Repository: torsten-rupp/bar
Catalog: barcontrol/po/*.po
Languages: german

source: filesystem
german: Dateisystem

source: device
german: Gerät

source: full
german: voll

source: incremental
german: inkrementell

source: differential
german: differentiell

source: continuous
german: fortlaufend

source: unknown
german: unbekannt

source: weeks
german: Wochen

source: week
german: Woche

source: days
german: Tage

source: day
german: Tag

source: h
german: Stunden

source: s
german: Sekunden

source: hour
german: Stunde

source: hours
german: Stunden

source: m
german: Minute

source: mins
german: Minuten

source: second
german: Sekunde

source: seconds
german: Sekunden

source: forever
german: unbegrenzt

source: {0} {0,choice,0#years|1#year|1<years}
german: {0} {0,choice,0#Jahre|1#Jahr|1<Jahre}

source: {0} {0,choice,0#months|1#month|1<months}
german: {0} {0,choice,0#Monate|1#Monat|1<Monate}

source: {0} {0,choice,0#weeks|1#week|1<weeks}
german: {0} {0,choice,0#Wochen|1#Woche|1<Wochen}

source: {0} {0,choice,0#days|1#day|1<days}
german: {0} {0,choice,0#Tage|1#Tag|1<Tage}

source: encryption
german: Verschlüsselung

source: Mon
german: Mo

source: Tue
german: Di

source: Wed
german: Mi

source: Thu
german: Do

source: Fri
german: Fr

source: Sat
german: Sa

source: Sun
german: So

source: ERROR
german: FEHLER

source: Warning
german: Warnung

source: INTERNAL ERROR
german: INTERNER FEHLER

source: Please report this error to
german: Bitte senden Sie den Fehlerreport an

source: Connect
german: Verbinden

source: Try to connect to ''
german: Verbindungsversuch zu ''

source: Established a none-TLS connection only. Certificate is expired. Transmitted data may be vulnerable!
german: Es wurde nur eine nicht verschlüsselte Verbindung aufgebaut. Zertifikat ist abgelaufen. Die übertragenen Daten sind angreifbar!

source: Established a none-TLS connection only. Transmitted data may be vulnerable!
german: Es wurde nur eine nicht verschlüsselte Verbindung aufgebaut. Die übertragenen Daten sind angreifbar!

source: Class/JAR file ''{0}'' changed. Is is recommended to restart BARControl now.
german: Klassen/JAR-Datei ''{0}'' hat sich geändert. Ein Neustart von BARControl wird empfohlen.

source: Cannot open default web browser: {0}
german: Fehler beim Öffnet des Standard-Webbrowsers: {0}

source: About
german: Über

source: Written by Torsten Rupp
german: Erstellt von Torsten Rupp

source: Copy version info to clipboard.
german: Kopiere Versionsinformationen in die Zwischenablage.

source: Close
german: Schliessen

source: Program
german: Programm

source: Abort
german: Abbrechen

source: Create operation
german: Erzeugen

source: Storage operation
german: Speichern

source: Restore operation
german: Wiederherstellen

source: Index update operation
german: Index erneuern

source: Index maintenance operation
german: Index-Wartungsoperation

source: Toggle suspend/continue
german: Anhalten/Weiter

source: Server settings
german: Server Einstellungen

source: Clear stored passwords on server
german: Gespeicherte Passworte auf Server löschen

source: Cannot clear passwords on server: {0}
german: Fehler beim Löschen der gespeicherten Passworte auf dem Server : {0}

source: Pair master
german: Hauptinstanz koppeln

source: Role
german: Rolle

source: Basic
german: Anwender

source: Expert
german: Experte

source: Set additional certificate authority (CA)
german: Zusätzliche Zertifikats-Autorisierungsdatei (CA)

source: Select certificate authority (CA) file
german: Wähle Zertifikats-Autorisierungsdatei (CA) aus

source: Certificate files PEM
german: PEM Zertifikatsdatei

source: Certificate files
german: Zertifikatsdatei Zertifizierungsstelle

source: All files
german: Alle Dateien

source: Reconnect to server with new certificate authority?
german: Mit neuer Zertifikats Autorisierungsdatei verbinden?

source: Reconnection fail
german: Neue Verbindung fehlgeschlagen

source: Reconnect with new certificate authority fail
german: Verbindung mit neuer Zertifikats-Autorisierungsdatei fehlgeschlagen

source: Try with insecure TLS (SSL)
german: Versuche ohne TLS (SSL)

source: Cancel
german: Abbrechen

source: Quit
german: Beenden

source: Help
german: Hilfe

source: Print debug memory dump
german: Speicherauszug ausgeben

source: Store debug memory dump
german: Speicherauszug speichern

source: Connection lost
german: Verbindung verloren

source: Try again
german: Neu versuchen

source: Login BAR server
german: Anmeldung BAR-Server

source: none
german: keine

source: try
german: versuchen

source: force
german: erzwingen

source: Password
german: Passwort

source: Pair new master
german: Kopplung neue Hauptinstanz

source: Wait for pairing
german: Warte auf Kopplung

source: Cannot set new master: {0}
german: Fehler beim Speichern der neuen Hauptinstanz: {0}

source: Restart
german: Wiederholen

source: Cannot restart pairing master: {0}
german: Fehler bei der Wiederholung der Kopplung der Hauptinstanz: {0}

source: Cannot stop pairing master: {0}
german: Beenden Kopplung Hauptinstanz fehlgeschlagen: {0}

source: Cannot start pairing master: {0}
german: Fehler beim Starten der Kopplung der Hauptinstanz: {0}

source: Cannot clear master: {0}
german: Aufhebung Kopplung Hauptinstanz fehlgeschlagen {0}

source: Connection fail
german: Verbindung fehlgeschlagen

source: Certificate:
german: Zertifikat:

source: Try without TLS (SSL)
german: Versuche ohne TLS/SSL

source: Cannot connect to server. No server ports specified!
german: Verbindung zum Server fehlgeschlagen. Es sind keine Portnummern definiert!

source: cannot connect to server (error: {0})
german: Verbindung zum Server fehlgeschlagen (Fehler: {0})

source: Wait for pairing new master
german: Warte auf Kopplung von neuer Hauptinstanz

source: cannot set new master ({0})
german: Fehler beim Speichern der neuen Hauptinstanz ({0})

source: job ''{0}'' not found
german: Auftrag ''{0}'' nicht gefunden

source: cannot start job ''{0}'' (error: {1})
german: Fehler beim Starten des Auftrags ''{0}'' (Fehler: {1})

source: cannot pause (error: {0})
german: Auftrag kann nicht pausiert werden (Fehler: {0})

source: cannot set maintenance (error: {0})
german: Fehler beim Setzen des Wartungszeitraums (Fehler: {0})

source: cannot suspend (error: {0})
german: Auftrag kann nicht angehalten werden (Fehler: {0})

source: cannot abort job ''{0}'' (error: {1})
german: Fehler beim Abbrechen des Auftrags ''{0}'' (Fehler: {1})

source: cannot get state (error: {0})
german: Fehler beim Ermitteln des Zustands (Fehler: {0})

source: State
german: Status

source: Host name
german: Rechnername

source: Type
german: Typ

source: Part size
german: Teilgröße

source: Compress
german: Kompression

source: Crypt
german: Verschlüsselung

source: Crypt type
german: Typ

source: Mode
german: Modus

source: Last executed
german: Letzte Ausführung

source: Estimated [s]
german: Geschätzt [s]

source: suspended
german: angehalten

source: {0} {0,choice,0#jobs|1#job|1<jobs}
german: {0} {0,choice,0#Aufträge|1#Auftag|1<Aufträge}

source: cannot get job list (error: {0})
german: Fehler beim Ermitteln der Auftragsliste (Fehler: {0})

source: Job
german: Auftrag

source: UUID
german: UUID Kennung

source: Date
german: Datum

source: Week days
german: Wochentage

source: Time
german: Zeit

source: Begin
german: Anfang

source: End
german: Ende

source: Last
german: Zuletzt

source: Next
german: Nächste

source: {0} {0,choice,0#jobs|1#schedule|1<schedules}
german: {0} {0,choice,0#Aufträge|1#Auftrag|1<Aufträge}

source: cannot get schedule list (error: {0})
german: Ermitteln der Auftragsliste fehlgeschlagen (Fehler: {0})

source: cannot get job info ''{0}'' (error: {1})
german: Fehler beim Lesen der Auftragsdaten ''{0}'' (Fehler: {1})

source: cannot get index info (error: {0})
german: Fehler beim Ermitteln der Indexinformationen (Fehler: {0})

source: cannot add ''{0}'' to index (error: {1})
german: Fehler beim Hinzufügen von ''{0}'' zum Index (Fehler: {1})

source: cannot remove index for storage ''{0}'' from index (error: {1})
german: Löschen aus dem Index für ''{0}'' fehlgeschlagen (Fehler: {1})

source: Entity id
german: Datensatz Kennung

source: Job id
german: Auftragsnummer

source: Size
german: Größe

source: Entry count
german: Anzahl Einträge

source: Entry size
german: Datensatz Größe

source: Date/Time
german: Datum/Zeit

source: {0} entities
german: {0} Datensätze

source: cannot list entities index (error: {0})
german: Fehler beim Ermitteln der Datensatzliste (Fehler: {0})

source: Storage id
german: Datensatz Kennung

source: Entity
german: Eintrag

source: {0} {0,choice,0#storages|1#storage|1<storages}
german: {0} {0,choice,0#Archive|1#Archiv|1<Archive}

source: cannot list storages index (error: {0})
german: Ermitteln der Archivliste fehlgeschlagen (Fehler {0})

source: Entry id
german: Datensatz Kennung

source: Storage
german: Sicherungen/Archive

source: {0} entries (max. 1024 shown)
german: {0} Einträge (max. 1024 angezeigt)

source: cannot list entries index (error: {0})
german: Fehler beim Ermitteln der Eintragsliste (Fehler: {0})

source: Hostname
german: Rechner

source: Duration
german: Dauer

source: Total [bytes]
german: Gesamt [Bytes]

source: Skipped [bytes]
german: Übersprungen [Bytes]

source: With errors [bytes]
german: Mit Fehlern [Bytes]

source: Message
german: Meldung

source: {0} {0,choice,0#entries|1#entry|1<entries}
german: {0} {0,choice,0#Einträge|1#Eintrag|1<Einträge}

source: cannot list history (error: {0})
german: Auftrag kann nicht zurückgesetzt werden (Fehler: {0})

source: cannot set restore list (error: {0})
german: Ermitteln der Wiederherstellungsliste fehlgeschlagen (Fehler: {0})

source: Please enter {0} login for: {1}
german: Bitte {0} Passwort eingeben für: {1}

source: Please enter {0} password for: {1}
german: Bitte {0} Passwort eingeben für: {1}

source: Cannot restore ''{0}'': {1} - skipped
german: Fehler bei der Wiederherstellung von ''{0}'': {1}

source: Restored {0} entries, {1} bytes
german: {0} Einträge, {1} Bytes wiederhergestellt

source: cannot restore storage ''{0}''
german: Fehler beim Wiederherstellen von ''{0}''

source: cannot restore storages (error: {0})
german: Wiederherstellen der Archive fehlgeschlagen (Fehler: {0})

source: cannot quit server
german: Beenden des Servers fehlgeschlagen

source: communication: {0}
german: Kommunikation: {0}

source: insufficient memory
german: Speicher nicht ausreichend

source: initialize failed
german: Initialisierung fehlgeschlagen

source: invalid argument
german: Ungültiger Wert

source: configuration error
german: Konfigurationsfehler

source: no writable configuration file
german: Konfigurationsdatei kann nicht geschrieben werden

source: aborted
german: abgebrochen

source: interrupted
german: unterbrochen

source: function not supported
german: Funktion wird nicht unterstützt

source: function still not implemented
german: Funktion noch nicht implementiert

source: run as daemon/service failed
german: Ausführung als Dienst fehlgeschlagen

source: inter-process communication failed
german: Prozesskommunikation fehlgeschlagen

source: initialize password failed
german: Fehler bei der Passwortinitialisierung

source: no password given
german: Kein Passwort

source: invalid password
german: Ungültiges Passwort

source: process data failed
german: Datenverarbeitung fehlgeschlagen

source: invalid encoding
german: Ungültiger Kodierung

source: convert characters
german: Zeichenkonvertierung

source: invalid pattern
german: Ungültiges Muster

source: no host name given
german: Kein Rechnername angegeben

source: host not found
german: Rechner nicht gefunden

source: bind failed
german: Netzwerkverbindung fehlgeschlagen

source: connect failed
german: Verbindung fehlgeschlagen

source: connect timeout
german: Zeitüberschreitung bei Verbindung

source: disconnected
german: nicht verbunden

source: too many concurrent connections
german: Zu viele Verbindungen gleichzeitig

source: no login name given
german: Kein Login-Name angegeben

source: sending data failed
german: Senden der Daten fehlgeschlagen

source: receiving data failed
german: Datenempfang fehlgeschlagen

source: execute command failed
german: Befehlsausführung fehlgeschlagen

source: timeout send data
german: Zeitüberschreitung beim Senden von Daten

source: timeout receive data
german: Zeitüberschreitung beim Empfangen von Daten

source: no response from remote
german: Keine Rückmeldung von Programm auf anderem Rechner

source: invalid response from remote
german: Ungültige Rückmeldung von Programm auf anderem Rechner

source: bad request
german: Ungültiger http-Befehl

source: initialize (TLS/SSL) failed
german: Initialisierung von TLS (SSL) fehlgeschlagen

source: no (TLS/SSL) certificate authority file
german: Keine TLS (SSL) Zertifikats-Authorisierungsdatei

source: no (TLS/SSL) certificate file
german: Kein TLS (SSL) Zertifikatsdatei

source: no (TLS/SSL) key file
german: Keine TLS (SSL) Schlüsseldatei

source: invalid (TLS/SSL) certificate authority
german: Ungültige TLS (SSL)-Zertifizierungsstelle

source: invalid (TLS/SSL) certificate
german: Ungültiges TLS (SSL)-Zertifikat

source: read (TLS/SSL) certificate fail
german: Lesen des (TLS/SSL) Zertifikats fehlgeschlagen

source: corrupt (TLS/SSL) certificate
german: beschädigtes TLS (SSL) Zertifikat

source: TLS (SSL) certificate expired
german: TLS (SSL)-Zertifikat abgelaufen

source: TLS (SSL) certificate is still not active
german: TLS (SSL)-Zertifikat noch nicht aktiv

source: TLS (SSL) handshake failedure
german: TLS (SSL)-Protokollfehler

source: invalid SSH specifier
german: Ungültiger SSH-Prefix

source: no SSH public key
german: Kein öffentlicher SSH-Schlüssel

source: no SSH private key
german: Kein privater SSH-Schlüssel

source: no SSH password given
german: Kein SSH-Passwort

source: for ''{0}''
german: für ''{0}''

source: invalid SSH password
german: Ungültiges SSH-Passwort

source: invalid SSH private key
german: Ungültiger privater SSH-Schlüssel

source: initialize SSH session failed
german: Initialisierung der SSH-Sitzung fehlgeschlagen

source: SSH authentication failed
german: SSH-Authentifizierung fehlgeschlagen

source: ssh protocol error
german: SSH Protokoll-Fehler

source: invalid SMB/CIFS specifier
german: Ungültige SMB/CIFS-Angabe

source: no SMB/CIFS password given
german: Kein SMB/CIFS-Passwort

source: initialize SMB/CIFS session failed
german: Initialisierung der SMB/CIFS-Sitzung fehlgeschlagen

source: SMB/CIFS authentication failed
german: SMB/CIFS-Authentifizierung fehlgeschlagen

source: invalid SMB/CIFS password
german: Ungültiges SMB/CIFS-Passwort

source: SMB/CIFS protocol error
german: SMB/CIFS Protokoll-Fehler

source: job ''{0}'' already exists
german: Auftrag ''{0}'' existiert bereits

source: job ''{0}'' running
german: Auftrag ''{0}'' wird ausgeführt

source: create job failed
german: Erzeugen eines neuen Auftrags fehlgeschlagen

source: delete job failed
german: Löschen eines Auftrags fehlgeschlagen

source: rename job failed
german: Umbenennen eines Auftrags fehlgeschlagem

source: initialize storage failed
german: Initialisierung der Archivierung fehlgeschlagen

source: no storage name given
german: Kein Archivname angegeben

source: invalid storage
german: Ungültiger Archivename

source: invalid FTP specifier
german: Ungültiger FTP-Prefix

source: initialize FTP session failed
german: Initialisierung der FTP-Sitzung fehlgeschlagen

source: no FTP password given
german: Kein FTP-Passwort

source: invalid FTP password
german: Ungültiges FTP-Passwort

source: invalid FTP user/password
german: Ungültiger FTP-Benutzer/Passwort

source: get FTP file size failed
german: Ermitteln der FTP-Dateigröße fehlgeschlagem

source: invalid WebDAV specifier
german: Ungültiger WebDAV-Prefix

source: initialize WebDAV session failed
german: Initialisierung der WebDAV-Sitzung fehlgeschlagen

source: no WebDAV password given
german: Kein WebDAV-Passwort

source: invalid WebDAV password
german: Ungültiges WebDAV-Passwort

source: invalid WebDAV user/password
german: Ungültiger WebDAV-Benutzer/Passwort

source: get WebDAV file size
german: Ermitteln der WebDAV-Dateigröße fehlgeschlagen

source: failed
german: fehlgeschlagen

source: WebDAV upload failed
german: Senden von Daten mit WebDAV fehlgeschlagen

source: WebDAV download failed
german: Empfangen der Daten mit WebDAV fehlgeschlagen

source: WebDAV failed
german: Initialisierung WebDAV fehlgeschlagen

source: initialize compress failed
german: Initialisierung der Kompression fehlgeschlagen

source: initialize decompress failed
german: Initialisierung der Dekompression fehlgeschlagen

source: end of compressed file
german: Komprimierte Datei unvollständig

source: delta source not found
german: Delta-Quelle nicht gefunden

source: invalid compress algorithm
german: Klicken um nach verwendetem Kompressionsalgorithmus zu sortieren

source: unknown compress algorithm
german: Klicken um nach verwendetem Kompressionsalgorithmus zu sortieren

source: compress algorithm not supported
german: Klicken um nach verwendetem Kompressionsalgorithmus zu sortieren

source: compress failed
german: Kompression fehlgeschlagen

source: decompress failed
german: Dekompression fehlgeschlagen

source: unsupported block length
german: Nicht unterstützte Blocklänge

source: initialize crypt failed
german: Initialisierung der Verschlüsselung fehlgeschlagen

source: no crypt key for cipher
german: Keinen Schlüssel für die Entschlüsslung gefunden

source: no password given for cipher
german: Kein Verschlüsselungspasswort

source: invalid decryption password
german: Ungültiges Verschlüsselungspasswort

source: encryption passwords mismatch
german: Nicht gleiche Entschlüsselungspassworte angegeben

source: initialize cipher failed
german: Initialisierung der Verschlüsselung fehlgeschlagen

source: create public/private key failed
german: Erzeugen des öffentlichen/privaten Schlüsselpaars fehlgeschlagen

source: initialize key failed
german: Initialisierung des Schlüssels fehlgeschlagen

source: public/private key not found
german: Öffentlicher/privater Schlüssel nicht gefunden

source: read public/private key failed
german: Lesen des öffentlichen/privaten Schlüsselpaars fehlgeschlagen

source: invalid key
german: Ungültiger Schlüssel

source: corrupt key
german: beschädigter Schlüssel

source: invalid key length
german: Ungültige Schlüssellänge

source: invalid block length
german: Ungültige Blocklänge

source: invalid salt length
german: Ungültige Länge Verschlüssungswert

source: no public encryption key
german: Kein öffentlicher Schlüssel

source: no private encryption key
german: Kein privater Schlüssel

source: key is not a public encryption key
german: Kein öffentlicher Schlüssel für Verschlüsselung

source: key is not a private encryption key
german: Kein privater Schlüssel für Verschlüsselung

source: no public signature key
german: Kein öffentlicher Signatur-Schlüssel

source: no private signature key
german: Kein privater Signatur-Schlüssel

source: key is not a public signature key
german: Schlüssel ist kein öffentlicher Signatur-Schlüssel

source: key is not a private signature key
german: Schlüssel ist kein privater Signatur-Schlüssel

source: key encryption failed
german: Verschlüsselung des Schlüssels fehlgeschlagen

source: key decryption failed
german: Entschlüsselung des Schlüssels fehlgeschlagen

source: wrong private decryption key
german: Falscher privater Verschlüsselungs-Schlüssel

source: invalid encryption algorithm
german: Ungültiger Verschlüsselungsalgorithmus

source: unknown encryption algorithm
german: Unbekannter Verschlüsselungsalgorithmus

source: encrypt failed
german: Verschlüsselung fehlgeschlagen

source: decrypt failed
german: Entschlüsselung fehlgeschlagen

source: initialize hash failed
german: Initialisierung des Hashwerts fehlgeschlagen

source: invalid hash algorithm
german: Ungültiger Hash-Algorithmus

source: unknown hash algorithm
german: Unbekannter Hash-Algorithmus

source: initialize message authentication code failed
german: Initialisierung des MAC fehlgeschlagen

source: invalid message authentication code algorithm
german: Ungültiger MAC-Algorithmus

source: unknown message authentication code algorithm
german: Unbekannter MAC-Algorithmus

source: directory not found
german: Verzeichnis nicht gefunden

source: no file name given
german: kein Dateiname angegeben

source: create file failed
german: Erzeugen der Datei fehlgeschlagen

source: open file failed
german: Öffnen der Datei fehlgeschlagen

source: create directory failed
german: Erzeugen des Verzeichnisses festgeschlagen

source: read file failed
german: Datei lesen fehlgeschlagen

source: end of file
german: Unerwartetes Dateiende

source: write file failed
german: Datei schreiben fehlgeschlagen

source: delete file failed
german: Datei löschen fehlgeschlagen

source: open directory
german: Verzeichnis öffnen

source: read directory failed
german: Fehler beim Lesen des Verzeichnisses

source: file ''{0}'' already exists
german: Datei ''{0}'' existiert bereits

source: file already exists
german: Datei existiert bereits

source: file not found
german: Datei nicht gefunden

source: access denied
german: Zugriff verweigert

source: not a directory
german: Kein Verzeichnis

source: end of directory list
german: Unerwartetes Verzeichnisende

source: init file notify failed
german: Initialisierung der Dateiänderungsbenachrichtigungen fehlgeschlagen

source: insufficient file notify entries
german: Nicht ausreichend Dateiänderungsbenachrichtigungen

source: i/o error
german: Ein-/Ausgabefehler

source: CD/DVD/BD device not found
german: CD/DVD/BD-Gerät nicht gefunden

source: open CD/DVD/BD failed
german: Öffnen des CD/DVD/BD-Mediums fehlgeschlagen

source: read CD/DVD/BD failed
german: Lesen des CD/DVD/BD-Medium fehlgeschlagen

source: write CD/DVD/BD failed
german: Schreiben des CD/DVD/BD-Medium fehlgeschlagen

source: verify CD/DVD/BD content failed
german: Prüfen des CD/DVD/BD-Mediums fehlgeschlagen

source: open ISO 9660 image failed
german: Öffnen des ISO 9669-Abbilds fehlgeschlagen

source: create ISO 9660 image failed
german: Erzeugen eines ISO 9669-Abbilds fehlgeschlagen

source: no device name given
german: Kein Gerätename angegeben

source: not a device
german: Kein Gerät

source: open device failed
german: Öffnen des Geräts fehlgeschlagen

source: invalid device block size
german: Ungültige Blockgröße des Geräts

source: read device failed
german: Lesen von Gerät fehlgeschlagen

source: write device failed
german: Schreiben auf das Gerät fehlgeschlagen

source: error parsing device list
german: Fehler beim Einlesen der Geräteliste

source: device not found
german: Gerät nicht gefunden

source: mount failed
german: Dateisystem einhängen fehlgeschlagen

source: unmount failed
german: Dateisystem aushängen fehlgeschlagen

source: no archive file name given
german: kein Archivname angegeben

source: not an archive file
german: Keine Archivdatei

source: archive not found
german: Archiv nicht gefunden

source: end of archive
german: Unerwartetes Ende des Archivs

source: no meta entry
german: Kein Meta-Eintrag

source: no file entry
german: Kein Datei-Eintrag

source: no file data entry
german: Kein Dateidaten-Eintrag

source: no directory entry
german: Kein Verzeichnis-Eintrag

source: no link entry
german: Kein symbolischer Verweis-Eintrag

source: no hard link entry
german: Kein Hardlink-Eintrag

source: no special entry
german: Kein Spezial-Eintrag

source: no image entry
german: Kein Abbild-Eintrag

source: no image data entry
german: Kein Abbilddaten-Eintrag

source: end of data
german: Unerwartetes Datenende

source: incomplete archive
german: Unvollständiges Archiv

source: insufficient split number digits in name
german: Unzureichende Anzahl von Ziffer für Archivteilung

source: wrong CRC
german: CRC-Fehler

source: at offset
german: ab
