Repository: torsten-rupp/bar
Catalog: barcontrol/po/*.po
Languages: german

source: When writing to a DVD with error-correction codes enabled some free space should be available on medium for error-correction codes (~20%). Good settings may be: - part size 470M, size 3.7G, medium 4.7G - part size 425M, size 6.8G, medium 8.5G - part size 470M, size 7.52G, medium 9.4G - part size 660M, size 10.56G, medium 13.2G - part size 850M, size 13.6G, medium 17G
german: Beim Schreiben der DVD mit Fehlerkorrektur wird Platz auf dem Speichermedium für die Korrekturkodes benötigt. Geeignete Einstellungen sind: - Teilgröße 470M, Größe 3,7G, Medium 4,7G - Teilgröße 425M, Größe 6,8G, Medium 8,5G - Teilgröße 470M, Größe 7,52G, Medium 9,4G - Teilgröße 6600M, Größe 10,56G, Medium 13,2G - Teilgröße 850M, Größe 13,6G, Medium 17G

source: When writing to a BD without setting medium size the resulting archive file may not fit on medium.
german: Beim Schreiben von BD ohne Archivteilung passt die erstellte Archivdatei möglicherweise nicht auf das Medium.

source: When writing to a BD with error-correction codes enabled some free space should be available on medium for error-correction codes (~20%). Good settings may be: - part size 1G, size 20G, medium 25G - part size 2G, size 40G, medium 50G - part size 5G, size 80G, medium 100G - part size 6.4G, size 102.4G, medium 128G
german: Beim Schreiben der BD mit Fehlerkorrektur wird Platz auf dem Speichermedium für die Korrekturkodes benötigt. Geeignete Einstellungen sind: - Teilgröße 1G, Größe 20G, Medium 25G - Teilgröße 2G, Größe 40G, Medium 50G - Teilgröße 5G, Größe 80G, Medium 100G - Teilgröße 6,4GGröße 102,4G, , Medium 128G

source: on master
german: auf Hauptinstanz

source: Enable for storage through master.
german: Speichern über Hauptinstanz.

source: Scripts
german: Skripte

source: Local
german: Lokal

source: Pre-script
german: Vorverarbeitungs-Skript

source: Command or script to execute before start of job. Macros: %name - job name %archive - archive name %type - archive type %file - archive file name %directory - archive directory Additional time macros are available.
german: Befehl oder Skript, das vor einem Auftrag ausgeführt werden soll. Makros: %name - Name Auftrag %archive - Name Archiv %type - Archivetyp %file - Name Archivdatei %directory - Name Archivverzeichnis Zusätzliche Zeit-Makros sind verfügbar.

source: Post-script
german: Nachverarbeitungs-Skript

source: Command or script to execute after termination of job. Macros: %name - job name %archive - archive name %type - archive type %T - archive type short %file - archive file name %directory - archive directory %error - error code %message - message %nextSchedule - next schedule [s] %nextScheduleDateTime - next schedule date/time [s] Additional time macros are available.
german: Befehl oder Skript, das nach einem Auftrag ausgeführt werden soll. Macros: %name - Name Auftrag %archive - Name Archiv %type - Archivetyp %T - Archivetyp kurz %file - Name Archivdatei %directory - Name Archivverzeichnis %error - Fehlercode %message - Nachricht %nextSchedule - nächste Auftragsausführung [s] %nextScheduleDateTime - nächste Auftragsausführung Zusätzliche Zeit-Makros sind verfügbar.

source: Command or script to execute before start of job on slave. Macros: %name - job name %archive - archive name %type - archive type %file - archive file name %directory - archive directory Additional time macros are available.
german: Befehl oder Skript, das vor einem Auftrag auf einer Nebeninstanz ausgeführt werden soll. Makros: %name - Name Auftrag %archive - Name Archiv %type - Archivetyp %file - Name Archivdatei %directory - Name Archivverzeichnis Zusätzliche Zeit-Makros sind verfügbar.

source: Command or script to execute after termination of job on slave. Macros: %name - job name %archive - archive name %type - archive type %T - archive type short %file - archive file name %directory - archive directory %error - error code %message - message %nextSchedule - next schedule [s] %nextScheduleDateTime - next schedule date/time Additional time macros are available.
german: Befehl oder Skript, das nach einem Auftrag auf einer Nebeninstanz ausgeführt werden soll. Macros: %name - Name Auftrag %archive - Name Archiv %type - Archivtyp %T - Archivtyp kurz %file - Name Archivdatei %directory - Name Archivverzeichnis %error - Fehlercode %message - Nachricht %nextSchedule - nächste Auftragsausführung [s] %nextScheduleDateTime - nächste Auftragsausführung Zusätzliche Zeit-Makros sind verfügbar.

source: Schedule
german: Zeitplan

source: Archive type
german: Archivtyp

source: Custom text
german: Benutzertext

source: Last created
german: Zuletzt erstellt

source: Total entities
german: Datensätze gesamt

source: Total entries
german: Einträge gesamt

source: Total size
german: Gesamtgröße

source: Trigger now
german: Jetzt starten

source: Add new schedule entry.
german: Neuen Eintrag zur Zeitplanung hinzufügen.

source: Edit schedule entry.
german: Eintrag in der Zeitplanung ändern.

source: Clone schedule entry.
german: Eintrag in der Zeitplanung duplizieren.

source: Remove schedule entry.
german: Eintrag aus der Zeitplanung entfernen.

source: Persistence
german: Persistenz

source: min. keep
german: min. Haltezahl

source: max. keep
german: max. Haltezahl

source: max. age
german: max. Alter

source: Created
german: Erstellt am

source: Age [days]
german: Alter [Tage]

source: Refresh
german: Neu erstellen

source: Remove from index
german: Aus Index löschen

source: Remove entity from index with {0} {0,choice,0#entries|1#entry|1<entries}?
german: Auftrag mit {0} {0,choice,0#Einträgen|1#Eintrag|1<Einträgen} entfernen?

source: Delete entity with {0} {0,choice,0#entries|1#entry|1<entries}, {1} ({2} {2,choice,0#bytes|1#byte|1<bytes})?
german: Auftrag mit {0} {0,choice,0#Einträgen|1#Eintrag|1<Einträgen}/{1} ({2} {2,choice,0#Bytes|1#Byte|1<Bytes}) löschen?

source: Add new persistence entry.
german: Neuen Eintrag zur Persistierung hinzufügen.

source: Edit persistence entry.
german: Eintrag in der Persistierung ändern.

source: Clone persistence entry.
german: Eintrag in der Persistierung duplizieren.

source: Remove persistence entry.
german: Eintrag aus der Persistierung entfernen.

source: Comment
german: Kommentar

source: Free text comment for job.
german: Freier Text als Kommentar für Auftrag.

source: New job
german: Neuer Auftrag

source: Cannot create new job: {0}
german: Fehler beim Erstellung eines neuen Auftrags: {0}

source: Clone job
german: Auftrag duplizieren

source: Cannot clone job ''{0}'': {1}
german: Fehler beim Duplizieren des Auftrags ''{0}'': {1}

source: Rename job
german: Auftrag umbenennen

source: Old name
german: Alter Name

source: New name
german: Neuer Name

source: Cannot rename job ''{0}'': {1}
german: Fehler beim Umbennen des Auftrags ''{0}'': {1}

source: Delete job ''{0}''?
german: Auftrag ''{0}'' löschen?

source: Cannot delete job ''{0}'': {1}
german: Fehler beim Löschen des Auftrags ''{0}'': {1}

source: Cannot get root list (error: {0})
german: Fehler beim Ermitteln der Wurzelverzeichnisse (Fehler: {0})

source: Cannot get file list (error: {0})
german: Fehler beim Ermitteln der Dateiliste (Fehler: {0})

source: Cannot get device list (error: {0})
german: Fehler beim Ermitteln der Geräteliste (Fehler: {0})

source: Pattern
german: Muster

source: Include pattern. Use * and ? as wildcards.
german: Muster für einzuschliessende Dateien. Es können * und ? verwendet werden.

source: Select remote path. CTRL+click to select local path.
german: Entfernten Pfad auswählen. Strg+Klick um einen lokalen Pfad auszuwählen.

source: Select entry
german: Eintrag wählen

source: file
german: Datei

source: image
german: Abbild

source: Cannot add include entry: {0}
german: Filter für Dateien kann nicht hinzugefügt werden: {0}

source: Cannot remove include entry: {0}
german: Fehler beim Entfernen des Einschlussfilters: {0}

source: Add new include pattern
german: Eintrag in der Filterliste hinzufügen

source: Edit include pattern
german: Eintrag in der Filterliste ändern

source: Clone include pattern
german: Eintrag in der Filterliste duplizieren

source: Remove {0} include {0,choice,0#patterns|1#pattern|1<patterns}?
german: {0} {0,choice,0#Dateifilter|1#Dateifilter|1<Dateifilter} entfernen?

source: Exclude pattern. Use * and ? as wildcards.
german: Muster für auszuschliessende Dateien. Es können * und ? verwendet werden.

source: Cannot add exclude entry: {0}
german: Ausschlussfilter kann nicht hinzugefügt werden: {0}

source: Cannot remove exclude entry: {0}
german: Fehler beim Entfernen des Ausschlussfilters: {0}

source: Add new exclude pattern
german: Eintrag in der Ausschlussliste hinzufügen

source: Edit exclude pattern
german: Eintrag in der Ausschlussliste ändern

source: Clone exclude pattern
german: Eintrag in der Ausschlussliste duplizieren

source: Remove {0} exclude {0,choice,0#patterns|1#pattern|1<patterns}?
german: {0} {0,choice,0#Ausschlussfilter|1#Ausschlussfilter|1<Ausschlussfilter} entfernen?

source: Mount name.
german: Namen Einhängepunkte.

source: Select name
german: Name wählen

source: Mount device (optional).
german: Gerät (optional).

source: Select device
german: Gerät auswählen

source: Cannot add mount data: {0}
german: Fehler beim Hinzufügen eines Dateisystem-Einhängepunktes: {0}

source: Cannot update mount data: {0}
german: Fehler beim Ändern eines Dateisystem-Einhängepunktes: {0}

source: Cannot remove mount data: {0}
german: Fehler beim Entfernen eines Dateisystem-Einhängepunktes: {0}

source: Add new mount
german: Neuer Dateisystem-Einhängepunkt hinzufügen

source: Edit mount
german: Einhängepunkt editieren

source: Clone mount
german: Dateisystem-Einhängepunkt duplizieren

source: Remove {0} {0,choice,0#mounts|1#mount|1<mounts}?
german: {0} {0,choice,0#Einhängepunkte|1#Einhängepunkt|1<Einhängepunkte} entfernen?

source: Cannot set/remove .nobackup for {0}: {1}
german: Fehler beim Setzen/Entfernen von .nodump für ''{0}'': {1}

source: Cannot set/clear no-dump attribute for {0}: {1}
german: Fehler beim Setzen/Entfernen der no-dump-Eigenschaft für ''{0}'': {1}

source: Cannot add source pattern: {0}
german: Filter für Delta-Quelldateien kann nicht hinzugefügt werden: {0}

source: Cannot remove source pattern: {0}
german: Fehler beim Entfernen der Delta-Quelldateienreferenz: {0}

source: Cannot clear source patterns: {0}
german: Fehler beim Löschen der Delta-Quelldateienreferenzen: {0}

source: Compress exclude pattern. Use * and ? as wildcards.
german: Von der Kompression auszuschliessende Dateien. Es können * und ? verwendet werden.

source: Cannot add compress exclude entry: {0}
german: Kompressionausschluss kann nicht hinzugefügt werden: {0}

source: Add new compress exclude pattern
german: Eintrag in der Kompressionsausschlussliste hinzufügen

source: Edit compress exclude pattern
german: Eintrag in der Kompressionsausschlussliste ändern

source: Cannot remove compress exclude entry: {0}
german: Fehler beim Entfernen des Kompression-Ausschlussfilters: {0}

source: Remove {0} selected compress exclude {0,choice,0#patterns|1#pattern|1<patterns}?
german: {0} {0,choice,0#Einträge|1#Eintrag|1<Einträge} aus der Kompressionsausschlussliste entfernen?

source: Drag to trashcan icon to the right to remove name part.
german: Auf das Mülleimersymbol rechts ziehen, um einen Namensteil zu entfernen.

source: Use drag&drop to remove name parts.
german: MIt Ziehen und Ablegen, um einen Namensteil zu entfernen.

source: Example
german: Beispiel

source: Use drag&drop to add name parts.
german: MIt Ziehen und Ablegen, um einen Namensteil hinzu zu fügen.

source: part number 1 digit
german: Teilnummer 1 Ziffer

source: part number 2 digits
german: Teilnummer 2 Ziffern

source: part number 3 digits
german: Teilnummer 3 Ziffern

source: part number 4 digits
german: Teilnummer 4 Ziffern

source: archive type: full ,incremental ,differential ,continuous
german: Archiv Typ: vollständig, inkrementell, differentiell, fortlaufend

source: archive type short: F, I, D, C
german: Archiv Typ kurz: F, I, D, C

source: universally unique identifier
german: eindeutiger Universal-Identifizierer

source: schedule custom text
german: Benutzertext

source: day 01..31
german: Tag 00..31

source: day of year 001..366
german: Tag im Jahr 001..366

source: month 01..12
german: Monat 01..12

source: month name
german: Monatsname

source: full month name
german: voller Monatsname

source: hour 00..23
german: Stunde 00..23

source: hour 00..12
german: Stunde 00..12

source: seconds 00..59
german: Sekunden 00..59

source: 'AM' or 'PM'
german: 'AM' oder 'PM'

source: 'am' or 'pm'
german: 'am' oder 'pm'

source: week day name
german: Wochentagsname

source: full week day name
german: voller Wochentagsname

source: day of week 1..7
german: Wochentag 1..7

source: day of week 0..6
german: Wochentag 0..6

source: week number 00..53 starting with Sunday
german: Wochennummer 00..53 beginnend mit Sonntag

source: week number 1 or 2 starting with Sunday
german: Wochennummer 1 oder 2 beginnend mit Sonntag

source: week number 1, 2, 3, 4 starting with Sunday
german: Wochennummer 1, 2, 3, 4 beginnend mit Sonntag

source: week number 00..53 starting with Monday
german: Wochennummer 00..53 beginnend mit Montag

source: week number 1 or 2 starting with Monday
german: Wochennummer 1 oder 2 beginnend mit Montag

source: week number 1, 2, 3, 4 starting with Monday
german: Wochennummer 1, 2, 3, 4 beginnend mit Montag

source: century two digits
german: Jahrhundert zwei Ziffern

source: year two digits
german: Jahr zwei Ziffern

source: year four digits
german: Jahr vier Ziffern

source: seconds since 1.1.1970 00:00
german: Sekunden seit den 1.1.1970 00:00

source: time-zone abbreviation
german: Zeizonen-Abkürzung

source: Date YYYY-MM-DD
german: Datum JJJJ-MM-TT

source: Time hh:mm:ss
german: Zeit hh:mm:ss

source: Edit storage file name
german: Archivedateiname editieren

source: Test script results
german: Ergebisse Skripttest

source: yes
german: ja

source: no
german: Nein

source: Cannot get schedule list (error: {0})
german: Ermitteln der Archiveliste fehlgeschlagen (Fehler: {0})

source: Execute job as normal backup (no incremental data).
german: Auftrag als normale Sicherung ausführen (keine Inkrementdaten).

source: Execute job as full backup.
german: Auftrag als Vollsicherung ausführen.

source: Execute job as incremental backup.
german: Auftrag als inkrementelle Sicherung ausführen.

source: Execute job as differential backup.
german: Auftrag als differentielle Sicherung ausführen.

source: Execute job as continuous backup.
german: Auftrag als fortlaufende Siucherung ausführen.

source: Interval time for continuous storage.
german: Intervalzeit für fortlaufendes Speichern.

source: 1 h
german: 1 Stunde

source: 2 h
german: 2 Stunden

source: 4 h
german: 4 Stunden

source: 8 h
german: 8 Stunden

source: Active time
german: Aktiverungszeitraum

source: Begin hour where continuous storage is active.
german: Anfangszeit für kontinuierliche Sicherungen.

source: Begin minute where continuous storage is active.
german: Anfangszeit für kontinuierliche Sicherungen.

source: End hour where continuous storage is active.
german: Endezeit für kontinuierliche Sicherungen.

source: End minute where continuous storage is active.
german: Endezeit für kontinuierliche Sicherungen.

source: test created archives
german: Archive testen

source: Test created archives.
german: Archive nach Erzeugen testen.

source: do no create storages
german: nicht speichern

source: Do not create storage files. Only update incremental data.
german: Keine Archive speichern. Nur Inkrementdaten erzeugen.

source: enabled
german: aktiviert

source: No specific time set. Really execute job every minute?
german: Keine Zeit angegeben. Auftrag wirklich jede Minute ausführen?

source: The job may not be triggered if the specified day is not in the set of specified weekdays. Really keep this setting?
german: Der Auftrag wird möglicherweise nicht ausgeführt, wenn der angegebene Tag nicht in der Menge der angegebenen Wochentage ist. Die Einstellungen wirklich so speichern?

source: New schedule
german: Neuer Zeitplan

source: Cannot create new schedule: {0}
german: Fehler beim Erstellung eines neuen Zeitplans: {0}

source: Edit schedule
german: Eintrag in der Zeitplanung ändern

source: Cannot update schedule entry: {0}
german: Fehler beim Speichern des Zeitplans: {0}

source: Clone schedule
german: Zeitplanung duplizieren

source: Cannot clone new schedule: {0}
german: Fehler beim Duplizieren des Zeitplans: {0}

source: Delete {0} selected schedule {0,choice,0#entries|1#entry|1<entries}?
german: {0} ausgewählte {0,choice,0#Zeitplanungen|1#Zeitplanung|1<Zeitplanungen} löschen?

source: Cannot delete schedule: {0}
german: Fehler beim Löschen des Zeitplans: {0}

source: Cannot trigger schedule of job ''{0}'': {1}
german: Fehler beim Starten des Zeitplaneintrags für ''{0}'': {1}

source: Keep
german: Speicherung

source: Min. number of archives to keep.
german: Min. Anzahl zu speichernder Archive für diesen Zeitplan.

source: Max. number of archives to keep.
german: Max. Anzahl zu speichernder Archive für diesen Zeitplan.

source: age
german: Alter

source: Max. age of archives to keep.
german: Max. Alter von Archive für diesen Zeitplan.

source: 2 days
german: 2 Tage

source: 4 days
german: 4Tage

source: 5 days
german: 5Tage

source: 6 days
german: 6Tage

source: 1 month
german: 1 Monat

source: 2 months
german: 2 Monate

source: 3 months
german: 3 Monate

source: 6 months
german: 6 Monate

source: 1 year
german: 1 Jahr

source: 18 months
german: 18 Monate

source: 2 years
german: 2 Jahre

source: 3 years
german: 3 Jahre

source: 4 years
german: 4 Jahre

source: 5 years
german: 5 Jahre

source: Move to
german: Verschieben nach

source: Name of directory to move storages to. Several macros are supported. Click on button to the right to open storage file name editor.
german: Verzeichnis in das Archive verschoben werden sollen. Es werden verschiedene Makros unterstützt. Klicken Sie auf die Schaltfläche rechts, um den Namenseditor zu öffnen.

source: Select remote directory. CTRL+click to select local directory.
german: Entferntes Verzeichnis auswählen. Strg+Klick um lokales Verzeichnis auszuwählen.

source: Select storage directory
german: Auswahl Speicherpfad

source: Storage destination type: into file system on FTP server on SSH server with scp (secure copy) on SSH server with sftp (secure FTP) on WebDAV server on WebDAV secure server on SMB/CIFS server
german: Speicherziel-Typ: in Dateisystem auf FTP-Server auf SSH-Server mit scp (secure copy) auf SSH-Server mit sftp (secure FTP) auf WebDAV-Server auf WebDAV-Secure-Server auf SMB/CIFS-Server

source: No max. keep set!
german: Kein max. Anzahl angegeben!

source: No max. age set!
german: Kein max. Alter angegeben!

source: Cannot add persistence entry: {0}
german: Fehler beim Hinzufügen des Persistenseintrags: {0}

source: Cannot update persistence data: {0}
german: Fehler beim Speichern des Persistenzeintrags: {0}

source: Cannot remove persistence data: {0}
german: Fehler beim Entfernen des Persistenzeintrags: {0}

source: Add new persistence
german: Neuen Persistierungseintrag hinzufügen

source: Edit persistence
german: Persistierungseinrag editieren

source: Clone persistence
german: Persistierungseintrag duplizieren

source: Remove {0} persistence {0,choice,0#entries|1#entry|1<entries}?
german: {0} ausgewählte {0,choice,0#Persistenzeinträge|1#Persistenzeintrag|1<Persistenzeinträge} löschen?

source: Schedule UUID
german: Zeitplan ID

source: Total entries size
german: Größe gesamt

source: Cannot refresh entity index data: {0}
german: Fehler beim Erneuern des Entitäts-Index: {0}

source: Cannot remove entity index data: {0}
german: Fehler beim Hinzufügen eines Dateisystem-Einhängepunktes: {0}

source: Delete storage indices and archives
german: Archiveindex und -dateien löschen

source: directory
german: Verzeichnis

source: link
german: Verknüpfung

source: hardlink
german: harte Verknüpfung

source: special
german: Besondere Dateien

source: There are {0} entries. Only the first {1} are shown in the list.
german: Es gibt {0} Einträge. Es werden lediglich die ersten {1} Einträge in der Liste angezeigt.

source: UUID id
german: UUID Kennung

source: Job UUID
german: Auftrag UUID

source: Last error
german: Letzter Fehler

source: Expire at
german: Ablaufdatum

source: Warnings
german: Warnungen

source: no job info
german: keine Auftragsinformationen

source: Copy name to clipboard.
german: Kopiere Name in die Zwischenablage.

source: Last checked
german: Letzte Ausführung

source: Error
german: Fehler

source: Fragments
german: Fragmente

source: Restore
german: Wiederherstellen

source: Storages
german: Sicherungen

source: Count: {0} / Size: {1}
german: Anzahl: {0} / Größe: {1}

source: Click to sort for name.
german: Klicken um nach Namen zu sortieren.

source: Click to sort for created date/time.
german: Klicken um nach Datum/Zeit zu sortieren.

source: Click to sort for size.
german: Klicken um nach Teilgrößen zu sortieren.

source: Click to sort for state.
german: Klicken um nach Status zu sortieren.

source: Archives
german: Archive

source: Click to sort for hostname.
german: Klicken um nach Rechnernamen zu sortieren.

source: Modified
german: Letzte Änderung

source: Click to sort for modification date/time.
german: Klicken um nach Datum/Zeit zu sortieren.

source: Refresh index
german: Indizes neu erstellen

source: Refresh all indices with error
german: Alle Indexeinträge mit Fehlerstatus neu erstellen

source: Assign to job
german: An Auftrag zuweisen

source: Set job type
german: Auftrags-Typ setzen

source: Add to index
german: Index hinzufügen

source: Remove all indices with error
german: Indexeinträge mit Fehlerstatus löschen

source: Mark all
german: Alle markieren

source: Unmark all
german: Alle Markierungen entfernen

source: Unmark all entries in list.
german: Alle Markierung in der Liste zurücknehmen.

source: Mark all entries in list.
german: Alle Einträge in der Liste markieren.

source: Enter filter key words for storage list.
german: Text eingeben für Filterung der Archivliste.

source: Enter text to filter storage list
german: Text eingeben für Filterung der Archivliste

source: Storage states filter.
german: Filter für Archivzustand.

source: error
german: Fehler

source: update
german: Index wird neu erstellt

source: update requested
german: Index neu erstellen

source: update/update requested
german: Index wird neu erstellt/neu erstellen

source: error/update/update requested
german: Fehler/Index wird neu erstellt/neu erstellen

source: not assigned
german: nicht zugewiesen

source: Start restoring selected archives.
german: Starte Wiederherstellen der ausgewählten Archive.

source: Click to sort for type.
german: Klicken um nach Typ zu sortieren.

source: Click to sort for date.
german: Klicken um nach Datum/Zeit zu sortieren.

source: Enter filter key words for entry list.
german: Text eingeben für Filterung der Dateiliste.

source: Enter text to filter entry list
german: Text eingeben für Filterung der Dateiliste

source: Entry type.
german: Eintrags-Typ.

source: files
german: Dateien

source: images
german: Abbilder

source: directories
german: Verzeichnisse

source: links
german: Verknüpfungen

source: hardlinks
german: harte Verknüpfungen

source: newest only
german: nur neuste

source: When this checkbox is enabled, only show newest entry instances and hide all older entry instances.
german: Falls aktiviert, werden nur die neusten Dateien angezeigt.

source: Start restoring selected entries.
german: Starte Wiederherstellen der ausgewählten Einträge.

source: There are {0} entries. Really mark all entries?
german: Es gibt {0} Einträge. Wirklich alle markieren?

source: Mark entries
german: Einträge markieren
