Repository: torsten-rupp/bar
Catalog: barcontrol/po/*.po
Languages: german

source: Cannot mark all storages! (error: {0})
german: Fehler beim Markieren aller Einträge: {0}

source: new
german: Neu

source: Assign entity date
german: Datum Entität hinzufügen

source: Assign
german: An Auftrag zuweisen

source: Assign storages
german: Archive zuweisen

source: Cannot create entity for ''{0}''! (error: {1})
german: Fehler beim Erzeugen der Entität für ''{0}'' (Fehler: {1})

source: Cannot assign index for {0}! (error: {1})
german: Fehler beim Zuweisen des Index für {0}! (Fehler: {1})

source: Communication error while assigning index database (error: {0})
german: Kommunikationsfehler beim Zuweisen des Datenbankindex {0}

source: Set archive type
german: Archivtyp setzen

source: Cannot set entity type for {0}! (error: {1})
german: Fehler beim Setzen des Entitätstyps für {0}! (Fehler: {1})

source: Communication error while set entity type in index database (error: {0})
german: Kommunikationsfehler beim Setzen des Entitätstyps im Datenbankindex (error: {0})

source: Test archives
german: Archive testen

source: Failed
german: Fehlgeschlagen

source: Aborting
german: Wird abgebrochen

source: Refresh index for {0} {0,choice,0#jobs|1#job|1<jobs}/{1} {1,choice,0#entities|1#entity|1<entities}/{2} {2,choice,0#archives|1#archive|1<archives}?
german: Index für {0}{0,choice,0#Aufträge|1#Auftrag|1<Aufträge}/{1}{1,choice,0#Entitäten|1#Entität|1<Entitäten}/{2} {2,choice,0#Archive|1#Archiv|1<Archive} neu erstellen?

source: Cannot refresh index for {0}! (error: {1})
german: Fehler beim Neuerstellen des Index für {0}! (Fehler: {1})

source: Communication error while refreshing index database (error: {0})
german: Kommunikationsfehler beim Neuerstellen der Indizes {0}

source: Refresh all indices with error state?
german: Alle Indexeinträge mit Fehlerstatus neu erstellen?

source: Cannot refresh database indices with error state! (error: {0})
german: Fehler beim Neuerstellen der Indizes mit Fehlerstatus (Fehler: {0})

source: Communication error while refreshing database indices (error: {0})
german: Kommunikationsfehler beim Neuerstellen von Indizes {0}

source: Select move-to path
german: Pfad zum Verschieben auswählen

source: Move storages
german: Archive verschieben

source: Cannot move entity! (error: {0})
german: Fehler beim Verschieben eines Auftrags: (Fehler: {0})

source: Communication error while moving entity (error: {0})
german: Kommunikationsfehler beim Verschieben eines Auftrags (Fehler: {0})

source: Add storage to index database
german: Archive zu Index hinzufügen

source: Archive name
german: Archivname

source: Enter local or remote storage path.
german: Eingabe eines lokalen oder entfernten Speicherpfads.

source: Select local storage file.
german: Wähle lokale Archivedatei aus.

source: Select storage
german: Wähle Archivdateiname aus

source: Storage type: into file system on FTP server on SSH server with sftp (secure FTP) on WebDAV server on WebDAV secure server on CD on DVD on BD on generic device
german: Speicherziel-Typ: in Dateisystem auf FTP-Server auf SSH-Server mit sftp (secure FTP) auf WebDAV-Server auf WebDAV-Secure-Server auf CD auf DVD auf BD auf ein allgemeines Gerät

source: Add indices
german: Index hinzufügen

source: Found archives: {0}
german: Gefundene Archive: {0}

source: Cannot add index to database for storage path ''{0}'' (error: {1})
german: Index für Archive kann nicht hinzugefügt werden ''{0}'' (Fehler: {1})

source: Cannot get total entries from database! (error: {0})
german: Ermitteln der Anzahl der Datenbankeinträge fehlgeschlagen! (Fehler: {0})

source: Remove {0} {0,choice,0#jobs|1#job|1<jobs}/{1} {1,choice,0#entities|1#entity|1<entities}/{2} {2,choice,0#archives|1#archive|1<archives} from index with {3} {3,choice,0#entries|1#entry|1<entries}?
german: Index mit {0} {0,choice,0#Aufträgen|1#Auftrag|1<Aufträgen}/{1} {1,choice,0#Entitäten|1#Entität|1<Entitäten}/{2} {2,choice,0#Archiven|1#Archiv|1<Archiven} mit {3} {3,choice,0#Einträgen|1#Eintrag|1<Einträgen} entfernen?

source: Remove indices
german: Index löschen

source: Cannot remove index for {0}! (error: {1})
german: Fehler beim Löschen des Index für {0}! (Fehler: {1})

source: Communication error while removing database indices (error: {0})
german: Kommunikationsfehler beim Löschen des Index {0}

source: Connection error while removing database indices (error: {0})
german: Kommunikationsfehler beim Löschen des Index (Fehler: {0})

source: Cannot get database indices with error state! (error: {0})
german: Fehler beim Ermitteln der Indizes mit Fehlerstatus (Fehler: {0})

source: Remove {0} {0,choice,0#storages|1#storage|1<storages} with error state?
german: {0} {0,choice,0#Indizes|1#Index|1<Indizes} mit Fehlerstatus löschen?

source: Cannot remove database indices with error state! (error: {0})
german: Fehler beim Löschen von Indizes mit Fehlerstatus (Fehler: {0})

source: #{0}: {1}, {2} {2,choice,0#entries|1#entry|1<entries}, {3} ({4} {4,choice,0#bytes|1#byte|1<bytes})
german: #{0}: {1}, {2} {2,choice,0#Einträge|1#Eintrag|1<Einträge}, {3} ({4} {4,choice,0#Bytes|1#Byte|1<Bytes})

source: Cannot get storages list! (error: {0})
german: Ermitteln der Archiveliste fehlgeschlagen! (Fehler: {0})

source: Delete {0} {0,choice,0#storage files|1#storage file|1<storage files} with {1} ({2} {2,choice,0#bytes|1#byte|1<bytes})?
german: {0} {0,choice,0#Dateien|1#Datei|1<Dateien}/{1} ({2} {2,choice,0#Bytes|1#Byte|1<Bytes}) löschen?

source: Cannot delete storage ''{0}'' (error: {1})
german: Fehler beim Löschen des Archivs ''{0}'' (error: {1})

source: Continue
german: Weiter

source: Continue with all
german: Weiter mit allen

source: Communication error while deleting storage (error: {0})
german: Kommunikationsfehler beim Löschen eines Archives (Fehler: {0})

source: Cannot mark all index entries! (error: {0})
german: Fehler beim Markieren aller Einträge: (Fehler: {0})

source: Restore archives
german: Archive wiederherstellen

source: Restore entries
german: Einträge wiederherstellen

source: Total
german: Gesamt

source: to
german: nach

source: Enable this checkbox and select a directory to restore entries to different location.
german: Aktivieren und ein Verzeichnis auswählen, wenn die Dateien in einem anderen Verzeichnis wiederhergestellt werden sollen.

source: Directory content
german: Verzeichnisinhalt

source: Restore content of selected directories, too.
german: Inhalt von Verzeichnissen wiederherstellen.

source: {0} {0,choice,0#entries|1#entry|1<entries}/{1} ({2} {2,choice,0#bytes|1#byte|1<bytes})
german: {0} {0,choice,0#Einträge|1#Eintrag|1<Einträge}/{1} ({2} {2,choice,0#Bytes|1#Byte|1<Bytes})

source: Sparse files/hardlinks
german: "spares" Dateien/Hardlinks

source: Restore as sparse files/hardlinks.
german: Wiederherstellen als "sparse" Dateien/Hardlinks.

source: Skip verify signatures
german: Signaturen nicht prüfen

source: Enable this checkbox when verification of signatures should be skipped.
german: Aktivieren, wenn Signaturen nicht geprüft werden soll.

source: Entry mode
german: Modus

source: If set to 'rename' then the new entry is renamed if entry already exists. If set to 'overwrite' then existing entries are overwritten. Otherwise stop with an error if entry exists.
german: Fall "umbenennen" aktiviert ist, wird ein neuer Name bei existierenden Dateien/Verzeichnisse erzeugt. Falls "überschreiben" aktiviert ist werden existierende Dateien/Verzeichnisse überschrieben. Andernfalls wird der Auftrag mit einem Fehler abgebrochen.

source: skip existing
german: existierende überspringen

source: Start restore
german: Wiederherstellen

source: Restore archives to: {0}
german: Archive wiederherstellen in: {0}

source: Restore entries to: {0}
german: Einträge wiederherstellen in: {0}

source: Failed entries
german: Fehlgeschlagene Einträge

source: Cannot restore: {0}
german: Wiederherstellen fehlgeschlagen: (Fehler: {0})

source: Error while restoring: {0}
german: Fehler beim Wiederherstellen: (Fehler: {0})

source: Connection error while restoring (error: {0})
german: Kommunikationsfehler beim Wiederherstellen (Fehler: {0})

source: waiting
german: warte

source: running (no storage)
german: wird ausgeführt (nicht speichern)

source: dry run
german: Test-Lauf

source: done
german: fertig

source: Waiting for temporary space
german: Warte auf freien temporären Speicherplatz

source: Blanking volume
german: Medium löschen

source: Creating image
german: Direktes Abbild

source: Adding error correction codes
german: Fehlerkorrekturcodes hinzufügen

source: Writing volume
german: Schreibe Medium

source: Verifing volume
german: Medium prüfen

source: offline
german: ausser Betrieb

source: wait pairing
german: warte auf Kopplung

source: wrong mode
german: falscher Modus

source: wrong protocol version
german: Falsche Protokollversion

source: List with job entries. Click to select job, right-click to open context menu.
german: Liste mit Aufträgen. Klicken Sie, um einen Auftrag auszuwählen, Rechts-Klick für Kontextmenü.

source: Click to sort for host.
german: Klicken um nach Rechner zu sortieren.

source: Click to sort for part size.
german: Klicken um nach Teilgrößen zu sortieren.

source: Click to sort for used compress algorithm.
german: Klicken um nach verwendetem Kompressionsalgorithmus zu sortieren.

source: Click to sort for used encryption algorithm.
german: Klicken um nach verwendetem Verschlüsselungsalgorithmus zu sortieren.

source: Click to sort for last date/time job was executed.
german: Klicken um nach Datum/Zeit der letzten Ausführung des Auftrags zu sortieren.

source: Estimated time
german: Geschätzte Restzeit

source: Click to sort for estimated rest time to execute job.
german: Klicken um nach geschätzter Restzeit für Ausführung des Auftrags zu sortieren.

source: Set optimal column width
german: Spaltenbreiten anpassen

source: no storage
german: nicht speichern

source: dry-run
german: Testlauf

source: Trigger
german: Jetzt starten

source: Volume
german: Medium

source: Reset state
german: Status zurücksetzen

source: Selected
german: Ausgewählt

source: Done
german: Bearbeitet

source: entries
german: Einträge

source: files/s
german: Dateien/s

source: Stored
german: Gespeichert

source: Ratio
german: Verhältnis

source: Skipped
german: Übersprungen

source: Errors
german: Fehler

source: File
german: Datei

source: Total files
german: Dateien gesamt

source: Total bytes
german: Bytes gesamt

source: Start selected job.
german: Ausgewählten Auftrag starten.

source: Abort selected job.
german: Ausgewählten Auftrag abbrechen.

source: Pause selected job for a specific time.
german: Ausgewählten Auftrag für die angegebene Zeit pausieren.

source: Suspend selected job for an infinite time.
german: Ausgewählten Auftrag anhalten.

source: Click when a new volume is available in drive.
german: Klicken wenn eine neues Medium im Laufwerk ist.

source: Quit BARControl program.
german: BARControl beenden.

source: Suspend
german: Anhalten

source: Please insert volume #{0}
german: Bitte Medium {0} einlegen

source: Please insert replacement volume #{0}
german: Bitte legen Sie einen Ersatz für das Medium #{0} ein

source: Cannot set crypt password for job ''{0}'' (error: {1})
german: Fehler beim Setzen des Verschlüsselungspassworts für Auftrag ''{0}'' (Fehler: {1})

source: Cannot start job ''{0}'' (error: {1})
german: Fehler beim Starten des Auftrags ''{0}'' (Fehler: {1})

source: Verify
german: Verifikation

source: Start job ''{0}''?
german: Auftrag ''{0}'' starten?

source: Full
german: Vollständig

source: Incremental
german: Inkrementell

source: Differential
german: Differentiell

source: No storage
german: Nicht speichern

source: Store all files.
german: Alle Dateien speichern.

source: Store all files as a full backup.
german: Alle Dateien als Vollsicherung speichern.

source: Store all files and create incremental data file.
german: Alle Dateien speichern und Inkrementdaten erzeugen.

source: Store changed files since last incremental or full storage and update incremental data file.
german: Speichern von veränderten Dateien seit dem letzten inkrementellen oder vollständigen Speichern und aktuallisieren der Inkrementdaten.

source: Store changed files since last full storage.
german: Speichern von veränderten Dateien seit dem letzten vollständigen Speichern.

source: Abort running job ''{0}''?
german: Laufenden Auftrag ''{0}'' abbrechen?

source: Abort job
german: Auftrag abbrechen

source: Cannot abort job (error: {0})
german: Auftrag kann nicht abgebrochen werden (Fehler: {0})

source: Communication error while abort job (error: {0})
german: Kommunikationsfehler beim Abbrechen eines Auftrags (Fehler: {0})

source: Connection error while abort job (error: {0})
german: Verbindungsfehler beim Abbrechen eines Auftrags (Fehler: {0})

source: Cannot pause job (error: {0})
german: Auftrag kann nicht pausiert werden (Fehler: {0})

source: Cannot suspend job (error: {0})
german: Auftrag kann nicht angehalten werden (Fehler: {0})

source: Volume request
german: Medium anfordern

source: Load volume number {0}.
german: Medium Nummer {0} laden.

source: Unload tray
german: Schublade öffnen

source: Cannot change volume (error: {0})
german: Name des Auftrags kann nicht geändert werden (Fehler: {0})

source: Cannot reset job (error: {0})
german: Auftrag kann nicht zurückgesetzt werden (Fehler: {0})

source: Entities
german: Datensätze

source: Statistics
german: Statistik

source: Count
german: Anzahl

source: Average time
german: Durchschnittliche Ausführungszeit
