Repository: torsten-rupp/bar
Catalog: barcontrol/po/*.po
Languages: german

source: entry is incomplete
german: Datei/Abbild ist unvollständig

source: wrong entry type
german: Falscher Eintrags-Typ

source: entries differ
german: Einträge verschieden

source: corrupt data or invalid password
german: Ungültige Daten oder ungültiges Passwort

source: invalid chunk size
german: Unbekannte Datenfragment-Größe

source: unknown chunk
german: Unbekanntes Datenfragment

source: invalid signature
german: Ungültige Signaturen

source: invalid incremental file
german: Ungültige Inkrementdatei

source: wrong incremental file version
german: Falsche Version der Inkrementdatei

source: corrupt incremental file
german: Inkrementdatei beschädigt

source: invalid device specifier
german: Ungültiges Geräte-Prefix

source: load volume failed
german: Medium laden fehlgeschlagen

source: parse command failed
german: Ungültige Befehlssyntax

source: expand command template failed
german: Befehlserzeugung aus Vorlage fehlgeschlagen

source: i/o redirect failed
german: Ein-/Ausgabeumleitung fehlgeschlagen

source: execute external program failed
german: Ausführen des externen Programms fehlgeschlagen

source: terminated external program
german: Externes Programm wurde beendet

source: execute external program timeout
german: Zeitüberschreitung beim Ausführen eines externen Programms

source: parsing data failed
german: Fehler beim Verarbeiten der Daten

source: parsing date failed
german: Fehler beim Lesen des Datums

source: parsing time failed
german: Fehler beim Lesen einer Zeitangabe

source: parsing weekdays failed
german: Fehler beim Lesen der Wochentagsangabe

source: parsing maintenance failed
german: Fehler beim Lesen der Wartungszeit

source: parsing schedule failed
german: Fehler beim Lesen des Zeitplans

source: unknown command
german: Unbekanntes Kommando

source: expected parameter
german: Parameter erwartet

source: unknown value
german: Unbekannter Wert

source: invalid value
german: Ungültiger Wert

source: deprecated or ignored value
german: veralteter oder ignorierter Wert

source: authorization failed
german: Authorisierungsfehler

source: job not found
german: Auftrag nicht gefunden

source: schedule not found
german: Zeitplan nicht gefunden

source: persistence not found
german: Persistenzeintrag nicht gefunden

source: maintenance not found
german: Wartungszeit nicht gefunden

source: server not found
german: Rechner nicht gefunden

source: entry not found
german: Dateneintrag nicht gefunden

source: pattern not found
german: Muster nicht gefunden

source: mount not found
german: Dateisystem-Einhängepunkt nicht gefunden

source: database
german: Datenbank

source: invalid database URI
german: Ungültige Datenbankbezeichnung

source: database type not supported
german: Datenbanktyp wird nicht unterstützt

source: database already exists
german: Datenbank existiert bereits

source: database not found
german: Datenbank nicht gefunden

source: connect to database failed
german: Verbindung zur Datenbank fehlgeschlagen

source: database connection lost
german: Datenbankverbindung verloren

source: database authorization failed
german: Datenbank Autorisierungsfehler

source: insufficient database version
german: Datenbankversion ist nicht ausreichend

source: unknown version of index
german: Unbekannte Indexversion

source: missing table
german: Datenbank-Tabelle nicht gefunden

source: missing column
german: Datenbank-Spalte nicht gefunden

source: obsolete table
german: Überflüssige Datenbanktabelle

source: obsolete column
german: Überflüssige Datenbankspalte

source: database bind failed
german: Datenbankverknüpfung fehlgeschlagen

source: type mismatch
german: Unpassender Datentyp

source: error creating index
german: Fehler beim Erstellen des Datenbank-Index

source: index not found
german: Datenbank-Index nicht gefunden

source: index still not initialized
german: Index noch nicht initialisiert

source: invalid index
german: Ungültiger Index

source: parse index id failed
german: Fehler beim Lesen der Datensatzkennung

source: database is locked
german: Datenbank ist gesperrt

source: database busy
german: Datenbank in Benutzung

source: database operation interrupted
german: Datenbankoperation unterbrochen

source: timeout accessing index
german: Zeitüberschreitung bei Zugriff auf Index

source: database entry not found
german: Datenbankeintrag nicht gefunden

source: master disconnected
german: Verbindung zu Hauptinstanz verloren

source: slave disconnected
german: Verbindung zu Nebeninstanz verloren

source: slave is not paired
german: Nebeninstanz nicht gekoppelt

source: instance is not a slave
german: Instanz ist keine Nebeninstanz

source: create PAR2 checksums fail
german: Erzeugen der PAR2 Prüfsumme fehlgeschlagen

source: invalid block size (multiple of 4)
german: Ungültige Blockgröße (vielfaches von 4)

source: PAR2 block size too small
german: PAR2 Blockgröße zu klein

source: too many PAR2 blocks (max. 32768)
german: Zu viele PAR2 Blöcke (max. 32768)

source: malformed command or result ''{0}''
german: Ungültiger Befehl oder ungültiges Ergebnis ''{0}''

source: Timeout reading data from server ''{0}''
german: Zeitüberschreitung beim Lesen von Rechner ''{0}''

source: Lost connection to server ''{0}''.
german: Verbindung zu Rechner ''{0}'' verloren.

source: Confirmation
german: Bestätigung

source: Cannot restore: {0} Reason: {1}
german: Fehler bei der Wiederherstellung des Archives {0} (Fehler: {1})

source: Skip
german: Überspringen

source: Skip all
german: Alle überspringen

source: Enter password
german: Passwort eingeben

source: running
german: wird ausgeführt

source: paused
german: pausiert

source: create
german: erstellen

source: restore
german: wiederherstellen

source: update index
german: Index aktualisieren

source: network
german: Netzwerk

source: Connection to host ''{0}:{1}'' failed (error: {2})
german: Verbindung zum Rechner ''{0}:{1}'' fehlgeschlagen (Fehler: {2})

source: TLS/SSL failure: expired certificate
german: TLS (SSL) Fehler: Zertifikat abgelaufen

source: TLS/SSL failure: {0}
german: TLS (SSL) Fehler: {0}

source: Host ''{0}:{1}'' unreachable (error: {2})
german: Rechner ''{0}:{1}'' ist nicht erreichbar (Fehler: {2})

source: Connection to host ''{0}:{1}'' refused
german: Verbindung zum Rechner ''{0}:{1}'' wurde abgelehnt

source: Host ''{0}:{1}'' unreachable (error: no route to host)
german: Rechner ''{0}:{1}'' ist nicht erreichbar (Fehler: kein Weiterleitung zum Rechner)

source: Unknown host ''{0}:{1}''
german: Unbekannter Rechner ''{0}:{1}''

source: Connection to host ''{0}:{1}''refused
german: Verbindung zum Rechner ''{0}:{1}'' wurde abgelehnt

source: No server ports specified
german: Keine Server-Portnummern angegeben

source: Incompatible protocol version for ''{0}:{1}'': : expected {2}, got {3}
german: Nicht kompatible Protokollversionen für''{0}:{1}'': erwartet {2}, vorhanden {3}

source: input/output error: {0}
german: Ein-/Ausgabe fehlgeschlagen: {0}

source: Password encryption fail
german: Verschlüsselung von Schlüssel fehlgeschlagen

source: No result from server
german: Keine Rückmeldung vom Server

source: Invalid response from server: expected SESSION
german: Ungültige Rückmeldung von anderem Rechner: SESSION

source: Invalid response from server: expected parameters
german: Ungültige Rückmeldung von anderem Rechner: Parameter erwartet

source: No session id
german: Keine Sitzungs-Identifikation

source: Init password cipher fail
german: Fehler bei Passwortinitialisierung

source: Invalid response from server: incomplete response ''{0}''
german: Ungültige Rückmeldung von anderem Rechner: unvollständig ''{0}''

source: Invalid response from server: no command id
german: Ungültige Rückmeldung von anderem Rechner: keine Befehls-Identifikation

source: Invalid response from server: parameters
german: Ungültige Rückmeldung von anderem Rechner: Parameter

source: ''{0}'' is not a valid size! Enter a number in the format ''n'' or ''n.m''. Optional units are KB, MB, or GB.
german: ''{0}'' ist keine gültige Größenangabe! Bitte geben Sie eine Zahl 'n' oder 'n.m' ein. Optional kann die Einheit KB, MB oder GB angehängt werden.

source: ''{0}'' is not valid time! Enter a time in the format ''n<{1}|{2}|{3}|{4}|{5}>''
german: ''{0}'' ist keine gültige Zeitangabe! Bitte geben Sie eine Zeit ein im Format ''n<{1}|{2}|{3}|{4}|{5}''

source: Select path name. Ctrl+Click to select local directory.
german: Pfad auswählen. Strg+Klick um einen lokalen Pfad auszuwählen.

source: Select path
german: Pfad auswählen

source: Select file name. Ctrl+Click to select local file.
german: Datei auswählen. Strg+Klick um eine lokale Datei auszuwählen.

source: Select file
german: Datei auswählen

source: Max. storage size
german: Max. Speicherplatzgröße

source: Storage size limit.
german: Archiv Größenbegrenzung.

source: unlimited
german: unbegrenzt

source: Archive file mode
german: Archivierungsmodus

source: If set to ''rename'' then the archive is renamed if it already exists. If set to ''append'' then data is appended to the existing archive files. If set to ''overwrite'' then existing archive files are overwritten. Otherwise stop with an error.
german: Falls "umbenennen" aktiviert ist, wird ein neuer Name bei bereits existierenden Archiven erzeugt. Falls "anhängen" aktiviert ist, wird an ein bestehendes Archiv angehängt. Falls "überschreiben" aktiviert ist, werden existierende Archive überschrieben. Andernfalls wird der Auftrag mit einem Fehler abgebrochen.

source: stop if exists
german: abbrechen, wenn vorhanden

source: rename if exists
german: umbenennen, wenn vorhanden

source: append
german: anhängen

source: overwrite
german: überschreiben

source: FTP server user login name. Leave it empty to use the default name from the configuration file.
german: FTP-Server Login-Name. Es ist keine Angabe erforderlich, wenn der Standardname aus der Konfigurationsdatei verwendet werden soll.

source: FTP server login password. Leave it empty to use the default password from the configuration file.
german: FTP-Server Login-Passwort. Es ist keine Angabe erforderlich, wenn das Passwort aus der Konfigurationsdatei verwendet werden soll.

source: If set to ''rename'' then the archive is renamed if it already exists. If set to ''append'' then data is appended to the existing archive files. If set to ''overwrite'' then existing archive files are overwritten.
german: Falls "umbenennen" aktiviert ist, wird ein neuer Name bei existierenden Dateien/Verzeichnisse erzeugt. Falls "anhängen" aktiviert ist, wird an ein bestehendes Archiv angehängt. Falls "überschreiben" aktiviert ist werden existierende Dateien/Verzeichnisse überschrieben. Andernfalls wird der Auftrag mit einem Fehler abgebrochen.

source: Port
german: Portnummer

source: SSH port number. Set to 0 to use default port number from configuration file.
german: SSH-Server Portnummer. Bei der Angabe von 0, wird der Standardport aus der Konfigurationsdatei verwendet.

source: SSH server user login name. Leave it empty to use the default name from the configuration file.
german: SSH-Server Login-Name. Es ist keine Angabe erforderlich, wenn der Standardname aus der Konfigurationsdatei verwendet werden soll.

source: SSH server login password. Leave it empty to use the default password from the configuration file.
german: SSH-Server Login-Passwort. Es ist keine Angabe erforderlich, wenn das Passwort aus der Konfigurationsdatei verwendet werden soll.

source: SSH public key
german: Öffentlicher SSH-Schlüssel

source: SSH public key file name. Leave it empty to use the default key file from the configuration file.
german: Datei mit dem öffentlichem SSH-Schlüssel. Es ist keine Angabe erforderlich, wenn die Schlüsseldatei aus der Konfigurationsdatei verwendet werden soll.

source: Select remote file. CTRL+click to select local file.
german: Entfernte Datei auswählen. Strg+Klick um eine lokale Datei auszuwählen.

source: Select SSH public key file
german: Öffentliche SSH-Schlüsseldatei

source: Public key files
german: Öffentliche Schlüsseldatei

source: SSH private key
german: Privater SSH-Schlüssel

source: SSH private key file name. Leave it empty to use the default key file from the configuration file.
german: Datei mit dem privaten SSH-Schlüssel. Es ist keine Angabe erforderlich, wenn die Schlüsseldatei aus der Konfigurationsdatei verwendet werden soll.

source: Select SSH private key file
german: Wählen Sie die private SSH-Schlüsseldatei aus

source: Share
german: Teilen

source: SMB/CIFS server share name. Leave it empty to use the default share name from the configuration file.
german: SMB/CIFS-Server Loginname. Es ist keine Angabe erforderlich, wenn der Standardname aus der Konfigurationsdatei verwendet werden soll.

source: WebDAV port number. Set to 0 to use default port number from configuration file.
german: WebDAV-Server Portnummer. Bei der Angabe von 0 wird der Standardport aus der Konfigurationsdatei verwendet.

source: WebDAV server user login name. Leave it empty to use the default name from the configuration file.
german: WebDAV-Server Login-Name. Es ist keine Angabe erforderlich, wenn der Standardname aus der Konfigurationsdatei verwendet werden soll.

source: WebDAV server login password. Leave it empty to use the default password from the configuration file.
german: WebDAV-Server Login-Passwort. Es ist keine Angabe erforderlich, wenn das Passwort aus der Konfigurationsdatei verwendet werden soll.

source: WebDAV public key
german: Öffentlicher WebDAV-Schlüssel

source: WebDAV public key file name. Leave it empty to use the default key file from the configuration file.
german: Datei mit dem öffentlichem WebDAV-Schlüssel. Es ist keine Angabe erforderlich, wenn die Schlüsseldatei aus der Konfigurationsdatei verwendet werden soll.

source: Select WebDAV public key file
german: Öffentlichen WebDAV-Schlüssel auswählen

source: WebDAV private key
german: Privater WebDAV-Schlüssel

source: WebDAV private key file name. Leave it empty to use the default key file from the configuration file.
german: Datei mit dem privaten WebDAV-Schlüssel. Es ist keine Angabe erforderlich, wenn die Schlüsseldatei aus der Konfigurationsdatei verwendet werden soll.

source: Select WebDAV private key file
german: Privaten WebDAV-Schlüssel auswählen

source: If set to 'append' then append data to existing archive files. If set to 'overwrite' then overwrite existing files. Otherwise stop with an error if archive file exists.
german: Falls "anhängen" aktiviert ist, wird an existiernede Archivdateien angehängt. Falls "überschreiben" aktiviert ist werden existierende Archivdateien überschrieben. Andernfalls wird der Auftrag mit einem Fehler abgebrochen.

source: rename
german: umbenennen

source: When writing to a CD/DVD/BD with error-correction codes enabled some free space should be available on medium for error-correction codes (~20%). Good settings may be: - part size 140M, size 560M, medium 700M - part size 800M, size 3.2G, medium 4.0G - part size 1800M, size 7.2G, medium 8.0G - part size 4G, size 20G, medium 25.0G - part size 10G, size 40G, medium 50.0G - part size 20G, size 80G, medium 100.0G
german: Beim Schreiben der CD/BD/BD mit Fehlerkorrektur wird Platz auf dem Speichermedium für die Korrekturkodes benötigt (ca. 20%). Geeignete Einstellungen sind: - Teilgröße 140M, Größe 560M, Medium 700M - Teilgröße 800M, Größe 3.2G, Medium 4.0G - Teilgröße 1800M, Größe 7.2G, Medium 8.0G - Teilgröße 4G, Größe 20G, Medium 25.0G - Teilgröße 10G, Größe 40G, Medium 50.0G - Teilgröße 20G, Größe 80G, Medium 100.0G

source: Device
german: Gerätename

source: Device name. Leave it empty to use system default device name.
german: Gerätename. Es ist keine Angabe erforderlich, wenn der Standardgerätename aus der Konfigurationsdatei verwendet werden soll.

source: Select remote device. CTRL+click to select local device.
german: Entferntes Gerät auswählen. Strg+Klick um lokales Gerät auszuwählen.

source: Select device name
german: Gerätname auswählen

source: Size of medium. You may specify a smaller value than the real physical size to leave some free space for error-correction codes.
german: Größe eines Mediums. Es ist möglich eine kleinere Größe anzugeben, wenn Platz für Fehlerkorrekturcodes frei bleiben soll.

source: Options
german: Optionen

source: add error-correction codes
german: Fehlerkorrekturcodes hinzufügen

source: Add error-correction codes to CD/DVD/BD image (require dvdisaster tool).
german: Fehlerkorrekturcodes für CD/DVD/BD hinzufügen (erfordert das Programm dvddisaster).

source: blank medium
german: Medium löschen

source: Blank medium before writing.
german: Medium löschen vor dem Schreiben.

source: wait for first volume
german: Warten bis das erste Medium eingelegt ist

source: Wait until first volume is loaded.
german: Warten bis das erste Medium geladen ist.

source: General
german: Allgemein

source: Temporary directory
german: Temporäres Verzeichnis

source: Path to temporary directory.
german: Pfad für temporäres Verzeichnis.

source: Max. size
german: Max. Speicherplatzgröße

source: Size limit for temporary files.
german: Größenlimit für temporäre Dateien.

source: Process nice level.
german: Prozess "Nice"-Level.

source: Max. number of threads
german: Max. Anzahl von Threads

source: Max. number of compression and encryption threads. Use 0 for number of available cpu cores.
german: Max. Anzahl von Kompressions- und Verschlüsselungsthreads. Bei Angabe von 0 wird die Anzahl verfügbarer CPU-Kerne verwendet.

source: Min. compress size
german: Min. Kompressionsgröße

source: Min. size of files for compression.
german: Min. Dateigröße für Kompression.

source: Jobs directory
german: Verzeichnis mit Aufträgen

source: Jobs directory.
german: Verzeichnis mit Aufträgen.

source: Max. continuous entry size
german: Max. Größe Eintrag in fortlaufender Sicherung

source: Size limit for continuous stored entries.
german: Größenlimit für eine Datei in einer fortlaufenden Sicherung.

source: Index database
german: Indexdatenbank

source: SQLite index database
german: SQLite Indexdatenbank

source: MariaDB index database
german: MariaDB Indexdatenbank

source: PostgreSQL index database
german: PostgreSQL Indexdatenbank

source: File name
german: Dateiname

source: Index database.
german: Indexdatenbank.

source: MariaDB/PostgreSQL server name.
german: MariaDB/PostgreSQL Datenbank Name.

source: User name
german: Benutzername

source: MariaDB/PostgreSQL user login name.
german: MariaDB/PostgreSQL Datenbank Login-Name.

source: MariaDB/PostgreSQL login password.
german: Kein Login-Password für MariaDB/PostgreSQL Datenbank.

source: Run requested index database updates.
german: Index-Datenbankoperationen ausführen.

source: Index update
german: Index erneuern

source: Auto add lost archives to index database.
german: Verlorene Archive automatisch dem Index hinzufügen.

source: Auto index update
german: Archivindex automatisch aktualisieren

source: Index database keep time
german: Haltezeit Indexdatenbank

source: Index database keep time for not existing storages.
german: Haltezeit in Indexdatenbank für nicht existierende Archive.

source: 1 day
german: 1Tag

source: 3 days
german: 3Tage

source: 1 week
german: 1Woche

source: 2 weeks
german: 2 Wochen

source: 3 weeks
german: 3 Wochen

source: 30 days
german: 30 Tage

source: Maintenance
german: Wartung

source: Click to sort by date.
german: Klicken um nach Datum zu sortieren.

source: Click to sort by week days.
german: Klicken um nach Wochentag zu sortieren.

source: Click to sort by begin time.
german: Klicken um nach Startzeit zu sortieren.

source: Click to sort by end time.
german: Klicken um nach Endezeit zu sortieren.

source: Add
german: Hinzufügen

source: Add maintenance time
german: Wartungszeit hinzufügen

source: Add maintenance time fail: {0}
german: Hinzufügen der Wartungszeit fehlgeschlagen: {0}

source: Edit
german: Ändern

source: Edit maintenance time
german: Wartungszeit editieren

source: Save
german: Speichern

source: Save maintenance time fail: {0}
german: Speicher der Wartungszeit fehlgeschlagen: {0}

source: Clone
german: Duplizieren

source: Clone maintenance time
german: Warungszeit duplizieren

source: Remove
german: Löschen

source: Delete maintenance time {0}, {1}..{2}?
german: Wartungszeit {0}, {1}..{2} löschen?

source: Delete maintenance time fail: {0}
german: Löschen der Wartungszeit fehlgeschlagen: {0}

source: Servers
german: Server

source: BAR server port number.
german: BAR Serverportnummer.

source: BAR certificate authority file or data.
german: BAR Zertifikatsdatei/Daten.

source: Cert
german: Zertifikatsdatei

source: BAR certificate file or data.
german: BAR Zertifikatsdatei/Daten.

source: Key
german: Schlüssel

source: BAR key file or data.
german: BAR Schüsseldatei/Daten.

source: BAR server password.
german: BAR Serverpasswort.

source: Storage servers
german: Server für Speicherung

source: Click to sort by type.
german: Klicken um nach Typ zu sortieren.

source: Click to sort by name.
german: Klicken um nach Namen zu sortieren.

source: Click to sort by max. number of concurrent connections.
german: Klicken um nach max. Anzahl gleichzeitiger Verbindungen zu sortieren.

source: Click to sort by max. storage size.
german: Klicken um nach Speichergrößen zu sortieren.

source: Add storage server
german: Speicherserver hinzufügen

source: Add storage server fail: {0}
german: Hinzufügen des Speicherservers fehltgeschlagen: {0}

source: Edit storage server
german: Speicherserver editieren

source: Save storage server settings fail: {0}
german: Speicher der Einstellungen fehlgeschlagen: {0}

source: Clone storage server
german: Speicherserver duplizieren

source: Delete settings of storage server ''{0}''?
german: Einstellungen für Speicherserver ''{0}'' löschen?

source: Delete storage server settings fail: {0}
german: Löschen der Einstellungen für Speicherserver fehgeschlagen: {0}

source: Commands
german: Befehle

source: Mount
german: Einhängepunkt

source: Command to mount device via mount point.
german: Befehl zum Einhängen eines Mediums über einen Einhängepunkt.

source: Mount device
german: Einzuhängendes Gerät

source: Command to mount device with name.
german: Befehl zum Auswerfen eines Mediums mit Namen.

source: Unmount
german: Dateisystem aushängen

source: Command to unmount device.
german: Befehl zum Aushängen eines Mediums.

source: Pre command
german: Vorbearbeitungsbefehl

source: Command to execute before job is started.
german: Befehl oder Skript, das vor dem Starten eines Auftrags ausgeführt werden soll.

source: Post command
german: Nachbearbeitungsbefehl

source: Command to execute after job terminated.
german: Befehl oder Skript, das nach dem Beenden eines Auftrags ausgeführt werden soll.

source: CD device name.
german: CD Gerätename.

source: Request medium command
german: Befehle neues Medium

source: Request medium command.
german: Befehl für Medium.

source: Unload command
german: Befehl zum Schublade öffnen

source: Command to unload CD.
german: Befehl zum Auswerfen einer CD.

source: Load command
german: Befehl zum Laden einer CD

source: Command to load CD.
german: Befehl zum Laden einer CD.

source: Image pre-command
german: Befehlszeile, die vor dem Erstellen eines Abbilds ausgeführt werden soll

source: Command to execute before creating CD image.
german: Befehlszeile, die vor dem Erstellen eines CD-Abbilds ausgeführt werden soll.

source: Image post-command
german: Befehlszeile, die nach dem Erstellen eines Abbilds ausgeführt werden soll

source: Command to execute after creating CD image.
german: Befehlszeile, die vor dem Erstellen eines CD-Abbilds ausgeführt werden soll.

source: Image command
german: Befehl für Erzeugung eines Abbilds

source: Image create command.
german: Befehl für Erzeugung eines Abbilds.
