Repository: torsten-rupp/bar
Catalog: barcontrol/po/*.po
Languages: german

source: ECC pre-command
german: Befehlszeile vor dem Erstellen von Fehlerkorrekturcodes

source: Command to execute before adding error correction codes.
german: Befehlszeile, die vor dem Hinzufügen der Fehlerkorrekturcodes ausgeführt werden soll.

source: ECC post-command
german: Befehlszeile nach dem Erstellen von Fehlerkorrekturcodes

source: Command to execute after adding error correction codes.
german: Befehlszeile, die nach dem Hinzufügen der Fehlerkorrekturcodes ausgeführt werden soll.

source: ECC command
german: Befehlszeile zum Erstellen von Fehlerkorrekturcodes

source: Command to add error correction codes.
german: Befehlszeile zum Hinzufügen der Fehlerkorrekturcodes.

source: Blank command
german: Befehl zum Löschen

source: Command to blank medium.
german: Befehl zum Löschen eines Mediums.

source: Write pre-command
german: Befehlszeile vor dem Schreiben

source: Command to execute before writing CD.
german: Befehlszeile, die vor dem Schreiben einer CD ausgeführt werden soll.

source: Write post-command
german: Befehlszeile nach dem Schreiben

source: Command to execute after writing CD.
german: Befehlszeile, die nach dem Schreiben einer CD ausgeführt werden soll.

source: Write command
german: Befehlszeile zum Schreiben

source: CD write command.
german: Befehlszeile zum Schreiben einer CD.

source: Image write command
german: Befehlszeile zum Schreiben eines Abbilds

source: CD image write command.
german: Befehlszeile zum Schreiben eines CD-Abbilds.

source: DVD device name.
german: Gerätename DVD.

source: Command to unload DVD.
german: Befehl zum Auswerfen einer DVD.

source: Command to load DVD.
german: Befehl zum Laden einer DVD.

source: Command to execute before creating DVD image.
german: Befehlszeile, die vor dem Erzeugen eines DVD-Abbilds ausgeführt werden soll.

source: Command to execute after creating DVD image.
german: Befehlszeile, die nach dem Erzeugen eines DVD-Abbilds ausgeführt werden soll.

source: Command to execute before writing DVD.
german: Befehlszeile, die vor dem Schreiben einer DVD ausgeführt werden soll.

source: Command to execute after writing DVD.
german: Befehlszeile, die nach dem Schreiben einer DVD ausgeführt werden soll.

source: DVD write command.
german: Befehl zum Schreiben einer DVD.

source: DVD image write command.
german: Befehl zum Schreiben eines DVD-Abbilds.

source: BD device name.
german: Gerätename BD.

source: Command to unload BD.
german: Befehl zum Auswerfen einer BD.

source: Command to load BD.
german: Befehl zum Laden einer BD.

source: Command to execute before creating BD image.
german: Befehlszeile, die vor dem Erzeugen eines BD-Abbilds ausgeführt werden soll.

source: Command to execute after creating BD image.
german: Befehlszeile, die nach dem Erzeugen eines BD-Abbilds ausgeführt werden soll.

source: Command to execute before writing BD.
german: Befehlszeile, die vor dem Schreiben BD ausgeführt werden soll.

source: Command to execute after writing BD.
german: Befehlszeile, die vor nach dem Schreiben einer BD ausgeführt werden soll.

source: BD write command.
german: Befehl zum Schreiben einer BD.

source: BD image write command.
german: Befehl zum Schreiben eines BD-Abbilds.

# Device (tab)
source: Device
german: Geräte

# Device (content)
source: Device
german: Gerätename

source: Device name.
german: Gerätename.

source: Command to unload device.
german: Befehl zum Auswerfen eines Mediums.

source: Command to load device.
german: Befehl zum Laden eines Mediums.

source: Command to execute before creating device image.
german: Befehlszeile, die vor dem Erzeugen einer Geräte-Abbilddatei ausgeführt werden soll.

source: Command to execute after creating device image.
german: Befehlszeile, die vor nach Erzeugen einer Geräte-Abbilddatei ausgeführt werden soll.

source: Command to execute before writing device.
german: Befehlszeile, die vor Schreiben auf ein Gerät ausgeführt werden soll.

source: Command to execute after writing device.
german: Befehlszeile, die nach Schreiben auf ein Gerät ausgeführt werden soll.

source: device write command.
german: Befehl zum Schreiben auf ein Gerät.

source: Output && Log
german: Ausgaben && Logging

source: Verbosity level
german: Detailgrad für Ausgaben

source: Verbosity level.
german: Detailierungsgrad für Ausgaben.

source: A verbose level of 3 or higher may slow down your system and flood the log file.
german: Ein Ausgabelevel von 3 oder höher kann zu einer hohen Systemlast und einer großen Logdatei führen.

source: Log
german: Logging

source: Log errors.
german: Fehler loggen.

source: errors
german: Fehler

source: Log warnings.
german: Warnungen loggen.

source: warnings
german: Warnungen

source: Log info.
german: Informationen loggen.

source: info
german: Information

source: Log stored/restored files.
german: Gespeicherte/Wiederhergestellte Dateien loggen.

source: Log unknown files.
german: Unbekannte Dateien loggen.

source: unknown files
german: Unbekannte Dateien

source: Log skipped files.
german: Übergangene Dateien loggen.

source: skipped files
german: Übergangene Dateien

source: Log missing files.
german: Nicht gefundene Dateien loggen.

source: missing files
german: Nicht gefundene Dateien

source: Log incomplete files.
german: Unvollständige Dateien loggen.

source: incomplete files
german: Unvollständige Dateien

source: Log excluded files.
german: Ausgeschlossene Dateien loggen.

source: excluded files
german: Ausgeschlossene Dateien

source: Log storage operations.
german: Speicheroperationen loggen.

source: storage operations
german: Speicheroperationen

source: Log index operations.
german: Indexoperationen loggen.

source: index operations
german: Indexoperationen

source: Log continuous operations.
german: Kontinuierliche Operationen in Log schreiben.

source: continuous operations
german: Kontinuierliche Operationen

source: all
german: alle

source: Log file
german: Log-Datei

source: Log file name.
german: Log-Dateiname.

source: Log files
german: Log-Dateien

source: Log format string.
german: Log-Format Zeichenkette.

source: Log post command
german: Nachbearbeitungsbefehl für Logdatei

source: Log post command.
german: Nachbearbeitungsbefehl für Logdatei.

source: Save settings
german: Server Einstellungen

source: Load settings
german: Lade Server Einstellungen

source: Get maintenance list fail: {0}
german: Fehler beim Empfangen der Wartungszeitliste: {0}

source: Get server list fail: {0}
german: Fehler beim Empfangen der Serverliste: {0}

source: Save server options fail (error: {0})
german: Speichern der Server-Einstellungen fehlgeschlagen (Fehler: {0})

source: Year to execute job. Leave to '*' for each year.
german: Jahr für die Ausführung des Auftrags. '*' für jedes Jahr.

source: Month to execute job. Leave to '*' for each month.
german: Monat für die Ausführung des Auftrags. '*' für jeden Monat.

source: Day to execute job. Leave to '*' for each day.
german: Tag für die Ausführung des Auftrags. '*' für jeden Tag.

source: Week days to execute job.
german: Woche für die Ausführung des Auftrags. '*' für jede Woche.

source: Toggle week days set.
german: Menge der Wochentage invertieren.

source: Hour to execute job. Leave to '*' for every hour.
german: Stunde für die Ausführung des Auftrags. '*' für jede Stunde.

source: Minute to execute job. Leave to '*' for every minute.
german: Minute für die Ausführung des Auftrags. '*' für jede Minute.

source: No weekdays specified!
german: Keine Wochentage angegeben!

source: The maintenance time may not be used if the specified day is not in the set of specified weekdays. Really keep this setting?
german: Die Wartungszeit wird möglicherweise nicht aktiv, wenn der angegebene Tag nicht in der Menge der angegebenen Wochentage ist. Die Einstellungen wirklich so speichern?

source: Port number. Set to 0 to use default port number.
german: Portnummer. 0 für Standard-Portnummer.

source: Set initial or new password. Note: existing password is not shown.
german: Intiales oder neues Passwort setzen. Hinweis: existierendes Passwort wird nicht angezeigt.

source: Public key
german: Öffentlicher Schlüssel

source: Set initial or new public key. Note: existing public key is not shown.
german: Intialen oder neuen öffnentlichen Schlüssel setzen. Hinweis: existierender Schlüssel wird nicht angezeigt.

source: Load
german: Laden

source: Select public key file
german: Öffentlichen SSH-Schlüssel auswählen

source: Public keys
german: Öffentliche Schlüssel

source: Key files
german: Schlüsseldateien

source: Cannot load public key file ''{0}'' (error: {1})
german: Fehler beim Laden des öffentlichen Schlüssels ''{0}'' (Fehler: {1})

source: Private key
german: Privater Schlüssel

source: Set initial or new private key. Note: existing private key is not shown.
german: Intialen oder neuen privaten Schlüssel setzen. Hinweis: existierender Schlüssel wird nicht angezeigt.

source: Select private key file
german: Wählen Sie die private Schlüsseldatei aus

source: Private keys
german: Private Schlüssel

source: Cannot load private key file ''{0}'' (error: {1})
german: Fehler beim Laden des privaten Schlüssels ''{0}'' (Fehler: {1})

source: Max. connections
german: Max. Anzahl Verbindungen

source: Max. number of concurrent connections. 0 for unlimited number of concurrent connections.
german: Max. Anzahl gleichzeitiger Verbindungen. 0 für unbegrenzt viele gleichzeitige Verbindungen.

source: Total size limit for storage.
german: Größenlimit für eine Speicherung.

source: Jobs
german: Aufträge

source: Existing job entries.
german: Vorhandene Aufträge.

source: New
german: Neu

source: Create new job entry.
german: Neuen Auftrag erstellen.

source: Clone an existing job entry.
german: Existierenden Auftrag duplizieren.

source: Rename
german: Umbenennen

source: Rename a job entry.
german: Auftrag umbenennen.

source: Delete
german: Löschen

source: Delete a job entry.
german: Auftrag löschen.

source: Hostname of slave to run job. Leave empty to run on host where BAR is executed.
german: Entfernter Rechner für Ausführung des Auftrags. Leerer Eintrag für den Rechner auf dem BAR selbst ausgeführt wird..

source: Port number. Set to 0 to use default port number from configuration file.
german: Portnummer. 0 für Standard-Portnummer.

source: Entries
german: Dateien

source: Click to sort by size.
german: Klicken um nach Teilgrößen zu sortieren.

source: Click to sort by modification time.
german: Klicken um nach Änderungs-Datum/Zeit zu sortieren.

source: Tree representation of files, directories, links and special entries. Double-click to open sub-directories, right-click to open context menu. Note size column: numbers in red color indicates size update is still in progress.
german: Ansicht mit Dateien, Verzeichnissen, Verknüpfung und besonderen Dateien. Doppel-Klick um Unverzeichnisse zu öffnen, Rechts-Klick für Kontextmenu. Hinweis Spalte Größe: Zahlen in rot zeigen an, dass die Ermittlung noch nicht abgeschlossen ist.

source: Open/Close
german: Öffnen/Schliessen

source: Include
german: Einschliessen

source: Exclude
german: Ausschliessen

source: Exclude by .nobackup
german: Ausgeschlossen durch .nobackup

source: Exclude by no dump
german: Ausgeschlossen durch no-dump

source: None
german: Nichts

source: Add mount
german: Dateisystem-Einhängepunkt hinzufügen

source: Remove mount
german: Dateisystem-Einhängepunkt entfernen

source: Directory/File size
german: Verzeichnis-/Dateigröße

source: Include entry in archive.
german: Datei zu Archiv hinzufügen.

source: Exclude entry from archive.
german: Datei von Archiv ausschliessen.

source: Do not include/exclude entry in/from archive.
german: Eintrag nicht in/aus Archiv ausschliessen.

source: Open all included directories.
german: Alle Verzeichnisse öffnen.

source: directory size
german: Verzeichnisgröße

source: Show directory sizes (sum of file sizes).
german: Verzeichnisgrößen anzeigen (Summe alle Dateigrößen).

source: Images
german: Abbilder

source: List of existing devices for image storage. Right-click to open context menu.
german: Liste der existierenden Geräte für Abbildspeicherung. Rechts-Klick für Kontextmenü.

source: Include selected device for image storage.
german: Ausgewähltes Gerät für Speicherung eines Abbilds einschliessen.

source: Exclude selected device from image storage.
german: Ausgewähltes Gerät für Speicherung eines Abbilds ausschliessen.

source: Remove selected device from image storage.
german: Ausgewähltes Gerät für Speicherung eines Abbilds entfernen.

source: Filters && Mounts
german: Filter && Einhängepunkte

source: Filters
german: Filter

source: Included
german: Eingeschlossen

source: List of include patterns, right-click for context menu.
german: Liste mit Einschlussmustern. Rechts-Klick für Kontextmenü.

source: Add entry to included list.
german: Datei der Liste hinzufügen.

source: Edit entry in included list.
german: Eintrag in der Liste verändern.

source: Clone entry in included list.
german: Eintrag in der Liste duplizieren.

source: Remove entry from included list.
german: Eintrag aus der Liste entfernen.

source: Excluded
german: Ausgeschlossen

source: List of exclude patterns, right-click for context menu.
german: Liste mit Ausschlussmustern. Klicken um Eintrag auszuwählen, Rechts-Klick für Kontextmenü.

source: Add entry to excluded list.
german: Eintrag zur der Ausschlussliste hinzufügen.

source: Edit entry in excluded list.
german: Eintrag in die Ausschlussliste ändern.

source: Clone entry in excluded list.
german: Eintrag in der Ausschlussliste duplizieren.

source: Remove entry from excluded list.
german: Eintrag aus der Ausschlussliste entfernen.

source: Include command
german: Einschluss-Skript

source: Command or script to execute to get a list of entries to include.
german: Befehlszeile zur Erzeugung einer Liste von einzuschliessenden Dateien und Verzeichnissen.

source: Test script.
german: Skript testen.

source: Command or script to execute to get a list of images to include.
german: Befehlszeile zur Erzeugung einer Liste von einzuschliessenden Abbildern.

source: Exclude command
german: Ausschluss-Skript

source: Command or script to execute to get a list of entries/images to exclude.
german: Befehlszeile zur Erzeugung einer Liste von auszuschliessenden Dateien, Verzeichnissen und Abbildern.

source: Mounts
german: Einhängepunkte

source: List of devices to mount, right-click for context menu.
german: Liste mit einzuhängenden Dateisystemen, Rechts-Klick für Kontextmenü.

source: Add entry to mount list.
german: Dateisystem-Einhängepunkt zu Liste hinzufügen.

source: Edit entry in mount list.
german: Dateisystem-Einhängepunkt in Liste editieren.

source: Clone entry in mount list.
german: Dateisystem-Einhängepunkt in Liste duplizieren.

source: Remove entry from mount list.
german: Dateisystem-Einhängepunkt entfernen.

source: skip unreadable entries
german: überspringe nicht lesbare Dateien

source: If enabled then skip not readable entries (write information to log file). If disabled stop job with an error.
german: Wenn aktiviert, nicht lesbare Einträge überspringen (Informationen werden in der Logdatei ausgegeben). Wenn nicht aktiviert, den Auftrag bei einem Fehler abbrechen.

source: no stop on owner error
german: fortfahren wenn Dateibesitzer nicht gesetzt werden kann

source: If enabled then do not stop if the owner of an entry cannot be set.
german: Wenn aktiviert, fortfahren wenn der Besitzer einer Datei nicht gesetzt werden kann.

source: no stop on attribute error
german: fortfahren bei Attribut-Fehler

source: If enabled then do not stop if there is an attribute error when reading a file.
german: Wenn aktiviert, fortfahren wenn ein Attribut einer Datei nicht gelesen werden kann.

source: raw images
german: direktes Abbild

source: If enabled then store all data of a device into an image. If disabled try to detect file system and only store used blocks to image.
german: Wenn aktiviert alle Datenblöcke des Geräts im Abbild speichern. Wenn nicht aktiviert, nur vom Dateisystem benutzte Datenblöcke speichern.

source: Compress && Crypt
german: Kompression && Verschlüsselung

source: Create storage files with an unlimited size. Do not split storage files.
german: Erzeuge Archive unbegrenzer Größe. Archive werden nicht aufgeteilt.

source: When writing to a CD/DVD/BD without splitting enabled the resulting archive file may not fit on medium.
german: Beim Schreiben von CD/DVD/BD ohne Archivteilung passt die erstellte Archivdatei möglicherweise nicht auf das Medium.

source: limit to
german: beschränken auf

source: Limit size of storage files to specified value.
german: Größe der Archivdateien auf die angegebene Größe begrenzen.

source: Size limit for one storage file part.
german: Größenlimit für eine Archivdatei.

source: Delta compression method to use.
german: Delta-Kompressionsverfahren.

source: Byte
german: Daten

source: Byte compression method to use.
german: Daten-Kompressionsverfahren.

source: Byte compression level to use.
german: Daten-Kompressionsverfahren.

source: Source
german: Quelle

source: Select source file
german: Wähle lokale Archivedatei aus

source: BAR files
german: BAR Dateien

source: Compress exclude
german: Kompressions Ausschluss

source: List of compress exclude patterns. Entries which match to one of these patterns will not be compressed. Right-click for context menu.
german: Liste mit Dateimustern für nicht zu komprimierende Dateien. Einträge, die auf eines der Dateimuster passen werden nicht komprimiert. Rechts-Klick für Kontextmenü.

source: Add most used compressed file suffixes
german: Gängige Kompressions-Dateiendung hinzufügen

source: Add most used multi-media file suffixes
german: Gängige Multi-Media-Dateiendungen hinfügen

source: Add most used package file suffixes
german: Gängige Archive-Dateiendungen hinzufügen

source: Add entry to compress exclude list.
german: Eintrag der Kompressionsausschlussliste hinzufügen.

source: Edit entry in compress exclude list.
german: Eintrag in der Kompressionsausschlussliste ändern.

source: Remove entry from compress exclude list.
german: Eintrag aus der Kompressionsausschlussliste entfernen.

source: Encryption methods to use.
german: Anzuwendende Verschlüsselungsmethode.

source: symmetric
german: symmetrisch

source: Use symmetric encryption with pass-phrase.
german: Verwende symmetrische Verschlüsselung mit Passwort.

source: asymmetric
german: asymmetrisch

source: Use asymmetric hybrid-encryption with pass-phrase and public/private key.
german: Verwende asymmetrische Hybrid-Verschlüsselung mit Passwort und Schlüsselpaar.

source: Public key file used for asymmetric encryption.
german: Öffentlicher Schlüssel für asymmetrische Verschlüsselung.

source: Crypt password
german: Verschlüsselungspasswort

source: default
german: Standard

source: Use default password from configuration file for encryption.
german: Verwende Standardpasswort aus der Konfiguration für die Verschlüsselung.

source: ask
german: fragen

source: Input password for encryption.
german: Eingabe des Verschlüsselungspassworts.

source: this
german: folgendes

source: Use specified password for encryption.
german: Angegebenes Passwort für die Verschlüsselung verwenden.

source: Password used for encryption.
german: Zu verwendendes Passwort für die Verschlüsselung.

source: Repeat
german: Wiederholen

source: Crypt passwords are not equal!
german: Verschlüsselungspassworte sind nicht gleich!

source: Normal mode: do not create incremental data files.
german: Alle Dateien speichern: keine Inkrementdaten erzeugen.

source: Full mode: store all entries and create incremental data files.
german: Alle Dateien speichern: Inkrementdaten erzeugen.

source: Incremental mode: store only modified entries since last full or incremental storage.
german: Inkrementell: speichern von veränderten Dateien seit dem letzten vollständigen oder inkrementellen Speichern.

source: Differential mode: store only modified entries since last full storage.
german: Differentiell: speichern von veränderten Dateien seit dem letzten vollständigen Speichern.

source: Name of storage files to create. Several macros are supported. Click on button to the right to open storage file name editor.
german: Archivdateiname. Es werden verschiedene Makros unterstützt. Klicken Sie auf die Schaltfläche rechts, um den Namenseditor zu öffnen.

source: Select storage file name
german: Wähle Archivedateiname aus

source: Incremental file name
german: Inkrementdateiname

source: Name of incremental data file. If no file name is given a name is derived automatically from the storage file name.
german: Name der Inkrementdatei. Falls kein Name angegeben ist, wird der Name automatisch aus dem Archivnamen abgeleitet.

source: Select incremental file
german: Wähle Sie die Inkrementdatei aus

source: BAR incremental data
german: BAR Inkrementdatei

source: Directory
german: Verzeichnis

source: Name of the directory to store PAR2 checksum files. If no directory is given no PAR2 checksum files are created.
german: Name des Verzeichnisses für die PAR2 Prüfsummendateien. Wenn kein Verzeichnis angegeben ist werden keien PAR2 Prüfsummer erzeugt.

source: Select PAR2 directory. CTRL+click to select local file.
german: Auswahl des PAR2 Verzeichnis. Strg+Klick um lokales Verzeichnis auszuwählen.

source: Select PAR2 checksums directory
german: Auswahl PAR2 Prüfsummenverzeichnis

source: Block size
german: Blockgröße

source: PAR2 block size.
german: PAR2 Blockgröße.

source: File count
german: Dateianzahl

source: PAR2 file count.
german: PAR2 Anzahl Dateien.

source: Block count
german: Blockanzahl

source: PAR2 block count.
german: PAR2 Blöcke.

source: Destination
german: Ziel

source: Storage destination type: into file system on FTP server on SSH server with sftp (secure FTP) on WebDAV server on WebDAV secure server on SMB/CIFS server on CD on DVD on BD on generic device
german: Speicherziel-Typ: in Dateisystem auf FTP-Server auf SSH-Server mit scp (secure copy) auf SSH-Server mit sftp (secure FTP) auf WebDAV-Server auf WebDAV-Secure-Server auf SMB/CIFS-Server auf CD auf DVD auf BD auf ein allgemeines Gerät

source: file system
german: Dateisystem

source: When writing to a CD without setting medium size the resulting archive file may not fit on medium.
german: Beim Schreiben von CD ohne Archivteilung passt die erstellte Archivdatei möglicherweise nicht auf das Medium.

source: When writing to a CD with error-correction codes enabled some free space should be available on medium for error-correction codes (~20%). Good settings may be: - part size 215M, size 430M, medium 540 - part size 260M, size 520M, medium 650 - part size 280M, size 560M, medium 700 - part size 250M, size 650M, medium 800 - part size 240M, size 720M, medium 900
german: Beim Schreiben der CD mit Fehlerkorrektur wird Platz auf dem Speichermedium für die Korrekturkodes benötigt. Geeignete Einstellungen sind: - Teilgröße 215M, Medium 540M - Teilgröße 260M, Medium 650M - Teilgröße 280M, Medium 700M - Teilgröße 250M, Medium 800G - Teilgröße 240M, Medium 900G

source: When writing to a DVD without setting medium size the resulting archive file may not fit on medium.
german: Beim Schreiben von DVD ohne Archivteilung passt die erstelllte Archivdatei möglicherweise nicht auf das Medium.
